/* automatically generated by rust-bindgen 0.72.1 */

pub type __time_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
impl Default for __atomic_wide_counter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
impl Default for __pthread_internal_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
impl Default for __pthread_cond_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
impl Default for pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
impl Default for pthread_cond_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __u16 = ::std::os::raw::c_ushort;
pub type __u32 = ::std::os::raw::c_uint;
pub type __u64 = ::std::os::raw::c_ulonglong;
pub type __be16 = __u16;
pub type __be32 = __u32;
pub type __be64 = __u64;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ib_uverbs_flow_action_esp_keymat {
    IB_UVERBS_FLOW_ACTION_ESP_KEYMAT_AES_GCM = 0,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ib_uverbs_flow_action_esp_replay {
    IB_UVERBS_FLOW_ACTION_ESP_REPLAY_NONE = 0,
    IB_UVERBS_FLOW_ACTION_ESP_REPLAY_BMP = 1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_flow_action_esp_encap {
    pub __bindgen_anon_1: ib_uverbs_flow_action_esp_encap__bindgen_ty_1,
    pub __bindgen_anon_2: ib_uverbs_flow_action_esp_encap__bindgen_ty_2,
    pub len: __u16,
    pub type_: __u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_flow_action_esp_encap__bindgen_ty_1 {
    pub val_ptr: *mut ::std::os::raw::c_void,
    pub val_ptr_data_u64: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_1::val_ptr"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap__bindgen_ty_1, val_ptr) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_1::val_ptr_data_u64"][::std::mem::offset_of!(
        ib_uverbs_flow_action_esp_encap__bindgen_ty_1,
        val_ptr_data_u64
    )
        - 0usize];
};
impl Default for ib_uverbs_flow_action_esp_encap__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_flow_action_esp_encap__bindgen_ty_2 {
    pub next_ptr: *mut ib_uverbs_flow_action_esp_encap,
    pub next_ptr_data_u64: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap__bindgen_ty_2"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_2>() - 8usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap__bindgen_ty_2"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_2>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_2::next_ptr"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap__bindgen_ty_2, next_ptr) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_2::next_ptr_data_u64"][::std::mem::offset_of!(
        ib_uverbs_flow_action_esp_encap__bindgen_ty_2,
        next_ptr_data_u64
    )
        - 0usize];
};
impl Default for ib_uverbs_flow_action_esp_encap__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap>() - 24usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap::len"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap, len) - 16usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap::type_"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap, type_) - 18usize];
};
impl Default for ib_uverbs_flow_action_esp_encap {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_action_esp {
    pub spi: __u32,
    pub seq: __u32,
    pub tfc_pad: __u32,
    pub flags: __u32,
    pub hard_limit_pkts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp>() - 24usize];
    ["Alignment of ib_uverbs_flow_action_esp"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp::spi"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, spi) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp::seq"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, seq) - 4usize];
    ["Offset of field: ib_uverbs_flow_action_esp::tfc_pad"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, tfc_pad) - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp::flags"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, flags) - 12usize];
    ["Offset of field: ib_uverbs_flow_action_esp::hard_limit_pkts"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, hard_limit_pkts) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_gid {
    pub raw: [u8; 16usize],
    pub global: ibv_gid__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_gid__bindgen_ty_1 {
    pub subnet_prefix: __be64,
    pub interface_id: __be64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid__bindgen_ty_1"][::std::mem::size_of::<ibv_gid__bindgen_ty_1>() - 16usize];
    ["Alignment of ibv_gid__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_gid__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_gid__bindgen_ty_1::subnet_prefix"]
        [::std::mem::offset_of!(ibv_gid__bindgen_ty_1, subnet_prefix) - 0usize];
    ["Offset of field: ibv_gid__bindgen_ty_1::interface_id"]
        [::std::mem::offset_of!(ibv_gid__bindgen_ty_1, interface_id) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid"][::std::mem::size_of::<ibv_gid>() - 16usize];
    ["Alignment of ibv_gid"][::std::mem::align_of::<ibv_gid>() - 8usize];
    ["Offset of field: ibv_gid::raw"][::std::mem::offset_of!(ibv_gid, raw) - 0usize];
    ["Offset of field: ibv_gid::global"][::std::mem::offset_of!(ibv_gid, global) - 0usize];
};
impl Default for ibv_gid {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_gid_type {
    IBV_GID_TYPE_IB = 0,
    IBV_GID_TYPE_ROCE_V1 = 1,
    IBV_GID_TYPE_ROCE_V2 = 2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_gid_entry {
    pub gid: ibv_gid,
    pub gid_index: u32,
    pub port_num: u32,
    pub gid_type: u32,
    pub ndev_ifindex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid_entry"][::std::mem::size_of::<ibv_gid_entry>() - 32usize];
    ["Alignment of ibv_gid_entry"][::std::mem::align_of::<ibv_gid_entry>() - 8usize];
    ["Offset of field: ibv_gid_entry::gid"][::std::mem::offset_of!(ibv_gid_entry, gid) - 0usize];
    ["Offset of field: ibv_gid_entry::gid_index"]
        [::std::mem::offset_of!(ibv_gid_entry, gid_index) - 16usize];
    ["Offset of field: ibv_gid_entry::port_num"]
        [::std::mem::offset_of!(ibv_gid_entry, port_num) - 20usize];
    ["Offset of field: ibv_gid_entry::gid_type"]
        [::std::mem::offset_of!(ibv_gid_entry, gid_type) - 24usize];
    ["Offset of field: ibv_gid_entry::ndev_ifindex"]
        [::std::mem::offset_of!(ibv_gid_entry, ndev_ifindex) - 28usize];
};
impl Default for ibv_gid_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_node_type {
    IBV_NODE_UNKNOWN = -1,
    IBV_NODE_CA = 1,
    IBV_NODE_SWITCH = 2,
    IBV_NODE_ROUTER = 3,
    IBV_NODE_RNIC = 4,
    IBV_NODE_USNIC = 5,
    IBV_NODE_USNIC_UDP = 6,
    IBV_NODE_UNSPECIFIED = 7,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_transport_type {
    IBV_TRANSPORT_UNKNOWN = -1,
    IBV_TRANSPORT_IB = 0,
    IBV_TRANSPORT_IWARP = 1,
    IBV_TRANSPORT_USNIC = 2,
    IBV_TRANSPORT_USNIC_UDP = 3,
    IBV_TRANSPORT_UNSPECIFIED = 4,
}
impl ibv_device_cap_flags {
    pub const IBV_DEVICE_RESIZE_MAX_WR: ibv_device_cap_flags = ibv_device_cap_flags(1);
    pub const IBV_DEVICE_BAD_PKEY_CNTR: ibv_device_cap_flags = ibv_device_cap_flags(2);
    pub const IBV_DEVICE_BAD_QKEY_CNTR: ibv_device_cap_flags = ibv_device_cap_flags(4);
    pub const IBV_DEVICE_RAW_MULTI: ibv_device_cap_flags = ibv_device_cap_flags(8);
    pub const IBV_DEVICE_AUTO_PATH_MIG: ibv_device_cap_flags = ibv_device_cap_flags(16);
    pub const IBV_DEVICE_CHANGE_PHY_PORT: ibv_device_cap_flags = ibv_device_cap_flags(32);
    pub const IBV_DEVICE_UD_AV_PORT_ENFORCE: ibv_device_cap_flags = ibv_device_cap_flags(64);
    pub const IBV_DEVICE_CURR_QP_STATE_MOD: ibv_device_cap_flags = ibv_device_cap_flags(128);
    pub const IBV_DEVICE_SHUTDOWN_PORT: ibv_device_cap_flags = ibv_device_cap_flags(256);
    pub const IBV_DEVICE_INIT_TYPE: ibv_device_cap_flags = ibv_device_cap_flags(512);
    pub const IBV_DEVICE_PORT_ACTIVE_EVENT: ibv_device_cap_flags = ibv_device_cap_flags(1024);
    pub const IBV_DEVICE_SYS_IMAGE_GUID: ibv_device_cap_flags = ibv_device_cap_flags(2048);
    pub const IBV_DEVICE_RC_RNR_NAK_GEN: ibv_device_cap_flags = ibv_device_cap_flags(4096);
    pub const IBV_DEVICE_SRQ_RESIZE: ibv_device_cap_flags = ibv_device_cap_flags(8192);
    pub const IBV_DEVICE_N_NOTIFY_CQ: ibv_device_cap_flags = ibv_device_cap_flags(16384);
    pub const IBV_DEVICE_MEM_WINDOW: ibv_device_cap_flags = ibv_device_cap_flags(131072);
    pub const IBV_DEVICE_UD_IP_CSUM: ibv_device_cap_flags = ibv_device_cap_flags(262144);
    pub const IBV_DEVICE_XRC: ibv_device_cap_flags = ibv_device_cap_flags(1048576);
    pub const IBV_DEVICE_MEM_MGT_EXTENSIONS: ibv_device_cap_flags = ibv_device_cap_flags(2097152);
    pub const IBV_DEVICE_MEM_WINDOW_TYPE_2A: ibv_device_cap_flags = ibv_device_cap_flags(8388608);
    pub const IBV_DEVICE_MEM_WINDOW_TYPE_2B: ibv_device_cap_flags = ibv_device_cap_flags(16777216);
    pub const IBV_DEVICE_RC_IP_CSUM: ibv_device_cap_flags = ibv_device_cap_flags(33554432);
    pub const IBV_DEVICE_RAW_IP_CSUM: ibv_device_cap_flags = ibv_device_cap_flags(67108864);
    pub const IBV_DEVICE_MANAGED_FLOW_STEERING: ibv_device_cap_flags =
        ibv_device_cap_flags(536870912);
}
impl ::std::ops::BitOr<ibv_device_cap_flags> for ibv_device_cap_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_device_cap_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_device_cap_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_device_cap_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_device_cap_flags> for ibv_device_cap_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_device_cap_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_device_cap_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_device_cap_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_device_cap_flags(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_fork_status {
    IBV_FORK_DISABLED = 0,
    IBV_FORK_ENABLED = 1,
    IBV_FORK_UNNEEDED = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_atomic_cap {
    IBV_ATOMIC_NONE = 0,
    IBV_ATOMIC_HCA = 1,
    IBV_ATOMIC_GLOB = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_alloc_dm_attr {
    pub length: usize,
    pub log_align_req: u32,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_alloc_dm_attr"][::std::mem::size_of::<ibv_alloc_dm_attr>() - 16usize];
    ["Alignment of ibv_alloc_dm_attr"][::std::mem::align_of::<ibv_alloc_dm_attr>() - 8usize];
    ["Offset of field: ibv_alloc_dm_attr::length"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, length) - 0usize];
    ["Offset of field: ibv_alloc_dm_attr::log_align_req"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, log_align_req) - 8usize];
    ["Offset of field: ibv_alloc_dm_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, comp_mask) - 12usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_dm_mask {
    IBV_DM_MASK_HANDLE = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_dm {
    pub context: *mut ibv_context,
    pub memcpy_to_dm: ::std::option::Option<
        unsafe extern "C" fn(
            dm: *mut ibv_dm,
            dm_offset: u64,
            host_addr: *const ::std::os::raw::c_void,
            length: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub memcpy_from_dm: ::std::option::Option<
        unsafe extern "C" fn(
            host_addr: *mut ::std::os::raw::c_void,
            dm: *mut ibv_dm,
            dm_offset: u64,
            length: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub comp_mask: u32,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_dm"][::std::mem::size_of::<ibv_dm>() - 32usize];
    ["Alignment of ibv_dm"][::std::mem::align_of::<ibv_dm>() - 8usize];
    ["Offset of field: ibv_dm::context"][::std::mem::offset_of!(ibv_dm, context) - 0usize];
    ["Offset of field: ibv_dm::memcpy_to_dm"]
        [::std::mem::offset_of!(ibv_dm, memcpy_to_dm) - 8usize];
    ["Offset of field: ibv_dm::memcpy_from_dm"]
        [::std::mem::offset_of!(ibv_dm, memcpy_from_dm) - 16usize];
    ["Offset of field: ibv_dm::comp_mask"][::std::mem::offset_of!(ibv_dm, comp_mask) - 24usize];
    ["Offset of field: ibv_dm::handle"][::std::mem::offset_of!(ibv_dm, handle) - 28usize];
};
impl Default for ibv_dm {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_device_attr {
    pub fw_ver: [::std::os::raw::c_char; 64usize],
    pub node_guid: __be64,
    pub sys_image_guid: __be64,
    pub max_mr_size: u64,
    pub page_size_cap: u64,
    pub vendor_id: u32,
    pub vendor_part_id: u32,
    pub hw_ver: u32,
    pub max_qp: ::std::os::raw::c_int,
    pub max_qp_wr: ::std::os::raw::c_int,
    pub device_cap_flags: ::std::os::raw::c_uint,
    pub max_sge: ::std::os::raw::c_int,
    pub max_sge_rd: ::std::os::raw::c_int,
    pub max_cq: ::std::os::raw::c_int,
    pub max_cqe: ::std::os::raw::c_int,
    pub max_mr: ::std::os::raw::c_int,
    pub max_pd: ::std::os::raw::c_int,
    pub max_qp_rd_atom: ::std::os::raw::c_int,
    pub max_ee_rd_atom: ::std::os::raw::c_int,
    pub max_res_rd_atom: ::std::os::raw::c_int,
    pub max_qp_init_rd_atom: ::std::os::raw::c_int,
    pub max_ee_init_rd_atom: ::std::os::raw::c_int,
    pub atomic_cap: ibv_atomic_cap,
    pub max_ee: ::std::os::raw::c_int,
    pub max_rdd: ::std::os::raw::c_int,
    pub max_mw: ::std::os::raw::c_int,
    pub max_raw_ipv6_qp: ::std::os::raw::c_int,
    pub max_raw_ethy_qp: ::std::os::raw::c_int,
    pub max_mcast_grp: ::std::os::raw::c_int,
    pub max_mcast_qp_attach: ::std::os::raw::c_int,
    pub max_total_mcast_qp_attach: ::std::os::raw::c_int,
    pub max_ah: ::std::os::raw::c_int,
    pub max_fmr: ::std::os::raw::c_int,
    pub max_map_per_fmr: ::std::os::raw::c_int,
    pub max_srq: ::std::os::raw::c_int,
    pub max_srq_wr: ::std::os::raw::c_int,
    pub max_srq_sge: ::std::os::raw::c_int,
    pub max_pkeys: u16,
    pub local_ca_ack_delay: u8,
    pub phys_port_cnt: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_device_attr"][::std::mem::size_of::<ibv_device_attr>() - 232usize];
    ["Alignment of ibv_device_attr"][::std::mem::align_of::<ibv_device_attr>() - 8usize];
    ["Offset of field: ibv_device_attr::fw_ver"]
        [::std::mem::offset_of!(ibv_device_attr, fw_ver) - 0usize];
    ["Offset of field: ibv_device_attr::node_guid"]
        [::std::mem::offset_of!(ibv_device_attr, node_guid) - 64usize];
    ["Offset of field: ibv_device_attr::sys_image_guid"]
        [::std::mem::offset_of!(ibv_device_attr, sys_image_guid) - 72usize];
    ["Offset of field: ibv_device_attr::max_mr_size"]
        [::std::mem::offset_of!(ibv_device_attr, max_mr_size) - 80usize];
    ["Offset of field: ibv_device_attr::page_size_cap"]
        [::std::mem::offset_of!(ibv_device_attr, page_size_cap) - 88usize];
    ["Offset of field: ibv_device_attr::vendor_id"]
        [::std::mem::offset_of!(ibv_device_attr, vendor_id) - 96usize];
    ["Offset of field: ibv_device_attr::vendor_part_id"]
        [::std::mem::offset_of!(ibv_device_attr, vendor_part_id) - 100usize];
    ["Offset of field: ibv_device_attr::hw_ver"]
        [::std::mem::offset_of!(ibv_device_attr, hw_ver) - 104usize];
    ["Offset of field: ibv_device_attr::max_qp"]
        [::std::mem::offset_of!(ibv_device_attr, max_qp) - 108usize];
    ["Offset of field: ibv_device_attr::max_qp_wr"]
        [::std::mem::offset_of!(ibv_device_attr, max_qp_wr) - 112usize];
    ["Offset of field: ibv_device_attr::device_cap_flags"]
        [::std::mem::offset_of!(ibv_device_attr, device_cap_flags) - 116usize];
    ["Offset of field: ibv_device_attr::max_sge"]
        [::std::mem::offset_of!(ibv_device_attr, max_sge) - 120usize];
    ["Offset of field: ibv_device_attr::max_sge_rd"]
        [::std::mem::offset_of!(ibv_device_attr, max_sge_rd) - 124usize];
    ["Offset of field: ibv_device_attr::max_cq"]
        [::std::mem::offset_of!(ibv_device_attr, max_cq) - 128usize];
    ["Offset of field: ibv_device_attr::max_cqe"]
        [::std::mem::offset_of!(ibv_device_attr, max_cqe) - 132usize];
    ["Offset of field: ibv_device_attr::max_mr"]
        [::std::mem::offset_of!(ibv_device_attr, max_mr) - 136usize];
    ["Offset of field: ibv_device_attr::max_pd"]
        [::std::mem::offset_of!(ibv_device_attr, max_pd) - 140usize];
    ["Offset of field: ibv_device_attr::max_qp_rd_atom"]
        [::std::mem::offset_of!(ibv_device_attr, max_qp_rd_atom) - 144usize];
    ["Offset of field: ibv_device_attr::max_ee_rd_atom"]
        [::std::mem::offset_of!(ibv_device_attr, max_ee_rd_atom) - 148usize];
    ["Offset of field: ibv_device_attr::max_res_rd_atom"]
        [::std::mem::offset_of!(ibv_device_attr, max_res_rd_atom) - 152usize];
    ["Offset of field: ibv_device_attr::max_qp_init_rd_atom"]
        [::std::mem::offset_of!(ibv_device_attr, max_qp_init_rd_atom) - 156usize];
    ["Offset of field: ibv_device_attr::max_ee_init_rd_atom"]
        [::std::mem::offset_of!(ibv_device_attr, max_ee_init_rd_atom) - 160usize];
    ["Offset of field: ibv_device_attr::atomic_cap"]
        [::std::mem::offset_of!(ibv_device_attr, atomic_cap) - 164usize];
    ["Offset of field: ibv_device_attr::max_ee"]
        [::std::mem::offset_of!(ibv_device_attr, max_ee) - 168usize];
    ["Offset of field: ibv_device_attr::max_rdd"]
        [::std::mem::offset_of!(ibv_device_attr, max_rdd) - 172usize];
    ["Offset of field: ibv_device_attr::max_mw"]
        [::std::mem::offset_of!(ibv_device_attr, max_mw) - 176usize];
    ["Offset of field: ibv_device_attr::max_raw_ipv6_qp"]
        [::std::mem::offset_of!(ibv_device_attr, max_raw_ipv6_qp) - 180usize];
    ["Offset of field: ibv_device_attr::max_raw_ethy_qp"]
        [::std::mem::offset_of!(ibv_device_attr, max_raw_ethy_qp) - 184usize];
    ["Offset of field: ibv_device_attr::max_mcast_grp"]
        [::std::mem::offset_of!(ibv_device_attr, max_mcast_grp) - 188usize];
    ["Offset of field: ibv_device_attr::max_mcast_qp_attach"]
        [::std::mem::offset_of!(ibv_device_attr, max_mcast_qp_attach) - 192usize];
    ["Offset of field: ibv_device_attr::max_total_mcast_qp_attach"]
        [::std::mem::offset_of!(ibv_device_attr, max_total_mcast_qp_attach) - 196usize];
    ["Offset of field: ibv_device_attr::max_ah"]
        [::std::mem::offset_of!(ibv_device_attr, max_ah) - 200usize];
    ["Offset of field: ibv_device_attr::max_fmr"]
        [::std::mem::offset_of!(ibv_device_attr, max_fmr) - 204usize];
    ["Offset of field: ibv_device_attr::max_map_per_fmr"]
        [::std::mem::offset_of!(ibv_device_attr, max_map_per_fmr) - 208usize];
    ["Offset of field: ibv_device_attr::max_srq"]
        [::std::mem::offset_of!(ibv_device_attr, max_srq) - 212usize];
    ["Offset of field: ibv_device_attr::max_srq_wr"]
        [::std::mem::offset_of!(ibv_device_attr, max_srq_wr) - 216usize];
    ["Offset of field: ibv_device_attr::max_srq_sge"]
        [::std::mem::offset_of!(ibv_device_attr, max_srq_sge) - 220usize];
    ["Offset of field: ibv_device_attr::max_pkeys"]
        [::std::mem::offset_of!(ibv_device_attr, max_pkeys) - 224usize];
    ["Offset of field: ibv_device_attr::local_ca_ack_delay"]
        [::std::mem::offset_of!(ibv_device_attr, local_ca_ack_delay) - 226usize];
    ["Offset of field: ibv_device_attr::phys_port_cnt"]
        [::std::mem::offset_of!(ibv_device_attr, phys_port_cnt) - 227usize];
};
impl Default for ibv_device_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_query_device_ex_input {
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_query_device_ex_input"]
        [::std::mem::size_of::<ibv_query_device_ex_input>() - 4usize];
    ["Alignment of ibv_query_device_ex_input"]
        [::std::mem::align_of::<ibv_query_device_ex_input>() - 4usize];
    ["Offset of field: ibv_query_device_ex_input::comp_mask"]
        [::std::mem::offset_of!(ibv_query_device_ex_input, comp_mask) - 0usize];
};
impl ibv_odp_transport_cap_bits {
    pub const IBV_ODP_SUPPORT_SEND: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(1);
    pub const IBV_ODP_SUPPORT_RECV: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(2);
    pub const IBV_ODP_SUPPORT_WRITE: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(4);
    pub const IBV_ODP_SUPPORT_READ: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(8);
    pub const IBV_ODP_SUPPORT_ATOMIC: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(16);
    pub const IBV_ODP_SUPPORT_SRQ_RECV: ibv_odp_transport_cap_bits = ibv_odp_transport_cap_bits(32);
}
impl ::std::ops::BitOr<ibv_odp_transport_cap_bits> for ibv_odp_transport_cap_bits {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_odp_transport_cap_bits(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_odp_transport_cap_bits {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_odp_transport_cap_bits) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_odp_transport_cap_bits> for ibv_odp_transport_cap_bits {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_odp_transport_cap_bits(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_odp_transport_cap_bits {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_odp_transport_cap_bits) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_odp_transport_cap_bits(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_odp_caps {
    pub general_caps: u64,
    pub per_transport_caps: ibv_odp_caps__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_odp_caps__bindgen_ty_1 {
    pub rc_odp_caps: u32,
    pub uc_odp_caps: u32,
    pub ud_odp_caps: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_odp_caps__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_odp_caps__bindgen_ty_1>() - 12usize];
    ["Alignment of ibv_odp_caps__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_odp_caps__bindgen_ty_1>() - 4usize];
    ["Offset of field: ibv_odp_caps__bindgen_ty_1::rc_odp_caps"]
        [::std::mem::offset_of!(ibv_odp_caps__bindgen_ty_1, rc_odp_caps) - 0usize];
    ["Offset of field: ibv_odp_caps__bindgen_ty_1::uc_odp_caps"]
        [::std::mem::offset_of!(ibv_odp_caps__bindgen_ty_1, uc_odp_caps) - 4usize];
    ["Offset of field: ibv_odp_caps__bindgen_ty_1::ud_odp_caps"]
        [::std::mem::offset_of!(ibv_odp_caps__bindgen_ty_1, ud_odp_caps) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_odp_caps"][::std::mem::size_of::<ibv_odp_caps>() - 24usize];
    ["Alignment of ibv_odp_caps"][::std::mem::align_of::<ibv_odp_caps>() - 8usize];
    ["Offset of field: ibv_odp_caps::general_caps"]
        [::std::mem::offset_of!(ibv_odp_caps, general_caps) - 0usize];
    ["Offset of field: ibv_odp_caps::per_transport_caps"]
        [::std::mem::offset_of!(ibv_odp_caps, per_transport_caps) - 8usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_odp_general_caps {
    IBV_ODP_SUPPORT = 1,
    IBV_ODP_SUPPORT_IMPLICIT = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_tso_caps {
    pub max_tso: u32,
    pub supported_qpts: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_tso_caps"][::std::mem::size_of::<ibv_tso_caps>() - 8usize];
    ["Alignment of ibv_tso_caps"][::std::mem::align_of::<ibv_tso_caps>() - 4usize];
    ["Offset of field: ibv_tso_caps::max_tso"]
        [::std::mem::offset_of!(ibv_tso_caps, max_tso) - 0usize];
    ["Offset of field: ibv_tso_caps::supported_qpts"]
        [::std::mem::offset_of!(ibv_tso_caps, supported_qpts) - 4usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_rx_hash_function_flags {
    IBV_RX_HASH_FUNC_TOEPLITZ = 1,
}
impl ibv_rx_hash_fields {
    pub const IBV_RX_HASH_SRC_IPV4: ibv_rx_hash_fields = ibv_rx_hash_fields(1);
    pub const IBV_RX_HASH_DST_IPV4: ibv_rx_hash_fields = ibv_rx_hash_fields(2);
    pub const IBV_RX_HASH_SRC_IPV6: ibv_rx_hash_fields = ibv_rx_hash_fields(4);
    pub const IBV_RX_HASH_DST_IPV6: ibv_rx_hash_fields = ibv_rx_hash_fields(8);
    pub const IBV_RX_HASH_SRC_PORT_TCP: ibv_rx_hash_fields = ibv_rx_hash_fields(16);
    pub const IBV_RX_HASH_DST_PORT_TCP: ibv_rx_hash_fields = ibv_rx_hash_fields(32);
    pub const IBV_RX_HASH_SRC_PORT_UDP: ibv_rx_hash_fields = ibv_rx_hash_fields(64);
    pub const IBV_RX_HASH_DST_PORT_UDP: ibv_rx_hash_fields = ibv_rx_hash_fields(128);
    pub const IBV_RX_HASH_IPSEC_SPI: ibv_rx_hash_fields = ibv_rx_hash_fields(256);
    pub const IBV_RX_HASH_INNER: ibv_rx_hash_fields = ibv_rx_hash_fields(2147483648);
}
impl ::std::ops::BitOr<ibv_rx_hash_fields> for ibv_rx_hash_fields {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_rx_hash_fields(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_rx_hash_fields {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_rx_hash_fields) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_rx_hash_fields> for ibv_rx_hash_fields {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_rx_hash_fields(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_rx_hash_fields {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_rx_hash_fields) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_rx_hash_fields(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_rss_caps {
    pub supported_qpts: u32,
    pub max_rwq_indirection_tables: u32,
    pub max_rwq_indirection_table_size: u32,
    pub rx_hash_fields_mask: u64,
    pub rx_hash_function: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_rss_caps"][::std::mem::size_of::<ibv_rss_caps>() - 32usize];
    ["Alignment of ibv_rss_caps"][::std::mem::align_of::<ibv_rss_caps>() - 8usize];
    ["Offset of field: ibv_rss_caps::supported_qpts"]
        [::std::mem::offset_of!(ibv_rss_caps, supported_qpts) - 0usize];
    ["Offset of field: ibv_rss_caps::max_rwq_indirection_tables"]
        [::std::mem::offset_of!(ibv_rss_caps, max_rwq_indirection_tables) - 4usize];
    ["Offset of field: ibv_rss_caps::max_rwq_indirection_table_size"]
        [::std::mem::offset_of!(ibv_rss_caps, max_rwq_indirection_table_size) - 8usize];
    ["Offset of field: ibv_rss_caps::rx_hash_fields_mask"]
        [::std::mem::offset_of!(ibv_rss_caps, rx_hash_fields_mask) - 16usize];
    ["Offset of field: ibv_rss_caps::rx_hash_function"]
        [::std::mem::offset_of!(ibv_rss_caps, rx_hash_function) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_packet_pacing_caps {
    pub qp_rate_limit_min: u32,
    pub qp_rate_limit_max: u32,
    pub supported_qpts: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_packet_pacing_caps"][::std::mem::size_of::<ibv_packet_pacing_caps>() - 12usize];
    ["Alignment of ibv_packet_pacing_caps"]
        [::std::mem::align_of::<ibv_packet_pacing_caps>() - 4usize];
    ["Offset of field: ibv_packet_pacing_caps::qp_rate_limit_min"]
        [::std::mem::offset_of!(ibv_packet_pacing_caps, qp_rate_limit_min) - 0usize];
    ["Offset of field: ibv_packet_pacing_caps::qp_rate_limit_max"]
        [::std::mem::offset_of!(ibv_packet_pacing_caps, qp_rate_limit_max) - 4usize];
    ["Offset of field: ibv_packet_pacing_caps::supported_qpts"]
        [::std::mem::offset_of!(ibv_packet_pacing_caps, supported_qpts) - 8usize];
};
impl ibv_raw_packet_caps {
    pub const IBV_RAW_PACKET_CAP_CVLAN_STRIPPING: ibv_raw_packet_caps = ibv_raw_packet_caps(1);
    pub const IBV_RAW_PACKET_CAP_SCATTER_FCS: ibv_raw_packet_caps = ibv_raw_packet_caps(2);
    pub const IBV_RAW_PACKET_CAP_IP_CSUM: ibv_raw_packet_caps = ibv_raw_packet_caps(4);
    pub const IBV_RAW_PACKET_CAP_DELAY_DROP: ibv_raw_packet_caps = ibv_raw_packet_caps(8);
}
impl ::std::ops::BitOr<ibv_raw_packet_caps> for ibv_raw_packet_caps {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_raw_packet_caps(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_raw_packet_caps {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_raw_packet_caps) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_raw_packet_caps> for ibv_raw_packet_caps {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_raw_packet_caps(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_raw_packet_caps {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_raw_packet_caps) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_raw_packet_caps(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_tm_cap_flags {
    IBV_TM_CAP_RC = 1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_tm_caps {
    pub max_rndv_hdr_size: u32,
    pub max_num_tags: u32,
    pub flags: u32,
    pub max_ops: u32,
    pub max_sge: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_tm_caps"][::std::mem::size_of::<ibv_tm_caps>() - 20usize];
    ["Alignment of ibv_tm_caps"][::std::mem::align_of::<ibv_tm_caps>() - 4usize];
    ["Offset of field: ibv_tm_caps::max_rndv_hdr_size"]
        [::std::mem::offset_of!(ibv_tm_caps, max_rndv_hdr_size) - 0usize];
    ["Offset of field: ibv_tm_caps::max_num_tags"]
        [::std::mem::offset_of!(ibv_tm_caps, max_num_tags) - 4usize];
    ["Offset of field: ibv_tm_caps::flags"][::std::mem::offset_of!(ibv_tm_caps, flags) - 8usize];
    ["Offset of field: ibv_tm_caps::max_ops"]
        [::std::mem::offset_of!(ibv_tm_caps, max_ops) - 12usize];
    ["Offset of field: ibv_tm_caps::max_sge"]
        [::std::mem::offset_of!(ibv_tm_caps, max_sge) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_cq_moderation_caps {
    pub max_cq_count: u16,
    pub max_cq_period: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_cq_moderation_caps"][::std::mem::size_of::<ibv_cq_moderation_caps>() - 4usize];
    ["Alignment of ibv_cq_moderation_caps"]
        [::std::mem::align_of::<ibv_cq_moderation_caps>() - 2usize];
    ["Offset of field: ibv_cq_moderation_caps::max_cq_count"]
        [::std::mem::offset_of!(ibv_cq_moderation_caps, max_cq_count) - 0usize];
    ["Offset of field: ibv_cq_moderation_caps::max_cq_period"]
        [::std::mem::offset_of!(ibv_cq_moderation_caps, max_cq_period) - 2usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_pci_atomic_op_size {
    IBV_PCI_ATOMIC_OPERATION_4_BYTE_SIZE_SUP = 1,
    IBV_PCI_ATOMIC_OPERATION_8_BYTE_SIZE_SUP = 2,
    IBV_PCI_ATOMIC_OPERATION_16_BYTE_SIZE_SUP = 4,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_pci_atomic_caps {
    pub fetch_add: u16,
    pub swap: u16,
    pub compare_swap: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_pci_atomic_caps"][::std::mem::size_of::<ibv_pci_atomic_caps>() - 6usize];
    ["Alignment of ibv_pci_atomic_caps"][::std::mem::align_of::<ibv_pci_atomic_caps>() - 2usize];
    ["Offset of field: ibv_pci_atomic_caps::fetch_add"]
        [::std::mem::offset_of!(ibv_pci_atomic_caps, fetch_add) - 0usize];
    ["Offset of field: ibv_pci_atomic_caps::swap"]
        [::std::mem::offset_of!(ibv_pci_atomic_caps, swap) - 2usize];
    ["Offset of field: ibv_pci_atomic_caps::compare_swap"]
        [::std::mem::offset_of!(ibv_pci_atomic_caps, compare_swap) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_device_attr_ex {
    pub orig_attr: ibv_device_attr,
    pub comp_mask: u32,
    pub odp_caps: ibv_odp_caps,
    pub completion_timestamp_mask: u64,
    pub hca_core_clock: u64,
    pub device_cap_flags_ex: u64,
    pub tso_caps: ibv_tso_caps,
    pub rss_caps: ibv_rss_caps,
    pub max_wq_type_rq: u32,
    pub packet_pacing_caps: ibv_packet_pacing_caps,
    pub raw_packet_caps: u32,
    pub tm_caps: ibv_tm_caps,
    pub cq_mod_caps: ibv_cq_moderation_caps,
    pub max_dm_size: u64,
    pub pci_atomic_caps: ibv_pci_atomic_caps,
    pub xrc_odp_caps: u32,
    pub phys_port_cnt_ex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_device_attr_ex"][::std::mem::size_of::<ibv_device_attr_ex>() - 400usize];
    ["Alignment of ibv_device_attr_ex"][::std::mem::align_of::<ibv_device_attr_ex>() - 8usize];
    ["Offset of field: ibv_device_attr_ex::orig_attr"]
        [::std::mem::offset_of!(ibv_device_attr_ex, orig_attr) - 0usize];
    ["Offset of field: ibv_device_attr_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_device_attr_ex, comp_mask) - 232usize];
    ["Offset of field: ibv_device_attr_ex::odp_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, odp_caps) - 240usize];
    ["Offset of field: ibv_device_attr_ex::completion_timestamp_mask"]
        [::std::mem::offset_of!(ibv_device_attr_ex, completion_timestamp_mask) - 264usize];
    ["Offset of field: ibv_device_attr_ex::hca_core_clock"]
        [::std::mem::offset_of!(ibv_device_attr_ex, hca_core_clock) - 272usize];
    ["Offset of field: ibv_device_attr_ex::device_cap_flags_ex"]
        [::std::mem::offset_of!(ibv_device_attr_ex, device_cap_flags_ex) - 280usize];
    ["Offset of field: ibv_device_attr_ex::tso_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, tso_caps) - 288usize];
    ["Offset of field: ibv_device_attr_ex::rss_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, rss_caps) - 296usize];
    ["Offset of field: ibv_device_attr_ex::max_wq_type_rq"]
        [::std::mem::offset_of!(ibv_device_attr_ex, max_wq_type_rq) - 328usize];
    ["Offset of field: ibv_device_attr_ex::packet_pacing_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, packet_pacing_caps) - 332usize];
    ["Offset of field: ibv_device_attr_ex::raw_packet_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, raw_packet_caps) - 344usize];
    ["Offset of field: ibv_device_attr_ex::tm_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, tm_caps) - 348usize];
    ["Offset of field: ibv_device_attr_ex::cq_mod_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, cq_mod_caps) - 368usize];
    ["Offset of field: ibv_device_attr_ex::max_dm_size"]
        [::std::mem::offset_of!(ibv_device_attr_ex, max_dm_size) - 376usize];
    ["Offset of field: ibv_device_attr_ex::pci_atomic_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, pci_atomic_caps) - 384usize];
    ["Offset of field: ibv_device_attr_ex::xrc_odp_caps"]
        [::std::mem::offset_of!(ibv_device_attr_ex, xrc_odp_caps) - 392usize];
    ["Offset of field: ibv_device_attr_ex::phys_port_cnt_ex"]
        [::std::mem::offset_of!(ibv_device_attr_ex, phys_port_cnt_ex) - 396usize];
};
impl Default for ibv_device_attr_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_mtu {
    IBV_MTU_256 = 1,
    IBV_MTU_512 = 2,
    IBV_MTU_1024 = 3,
    IBV_MTU_2048 = 4,
    IBV_MTU_4096 = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_port_state {
    IBV_PORT_NOP = 0,
    IBV_PORT_DOWN = 1,
    IBV_PORT_INIT = 2,
    IBV_PORT_ARMED = 3,
    IBV_PORT_ACTIVE = 4,
    IBV_PORT_ACTIVE_DEFER = 5,
}
pub const IBV_LINK_LAYER_UNSPECIFIED: _bindgen_ty_13 = _bindgen_ty_13::IBV_LINK_LAYER_UNSPECIFIED;
pub const IBV_LINK_LAYER_INFINIBAND: _bindgen_ty_13 = _bindgen_ty_13::IBV_LINK_LAYER_INFINIBAND;
pub const IBV_LINK_LAYER_ETHERNET: _bindgen_ty_13 = _bindgen_ty_13::IBV_LINK_LAYER_ETHERNET;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_13 {
    IBV_LINK_LAYER_UNSPECIFIED = 0,
    IBV_LINK_LAYER_INFINIBAND = 1,
    IBV_LINK_LAYER_ETHERNET = 2,
}
impl ibv_port_cap_flags {
    pub const IBV_PORT_SM: ibv_port_cap_flags = ibv_port_cap_flags(2);
    pub const IBV_PORT_NOTICE_SUP: ibv_port_cap_flags = ibv_port_cap_flags(4);
    pub const IBV_PORT_TRAP_SUP: ibv_port_cap_flags = ibv_port_cap_flags(8);
    pub const IBV_PORT_OPT_IPD_SUP: ibv_port_cap_flags = ibv_port_cap_flags(16);
    pub const IBV_PORT_AUTO_MIGR_SUP: ibv_port_cap_flags = ibv_port_cap_flags(32);
    pub const IBV_PORT_SL_MAP_SUP: ibv_port_cap_flags = ibv_port_cap_flags(64);
    pub const IBV_PORT_MKEY_NVRAM: ibv_port_cap_flags = ibv_port_cap_flags(128);
    pub const IBV_PORT_PKEY_NVRAM: ibv_port_cap_flags = ibv_port_cap_flags(256);
    pub const IBV_PORT_LED_INFO_SUP: ibv_port_cap_flags = ibv_port_cap_flags(512);
    pub const IBV_PORT_SYS_IMAGE_GUID_SUP: ibv_port_cap_flags = ibv_port_cap_flags(2048);
    pub const IBV_PORT_PKEY_SW_EXT_PORT_TRAP_SUP: ibv_port_cap_flags = ibv_port_cap_flags(4096);
    pub const IBV_PORT_EXTENDED_SPEEDS_SUP: ibv_port_cap_flags = ibv_port_cap_flags(16384);
    pub const IBV_PORT_CAP_MASK2_SUP: ibv_port_cap_flags = ibv_port_cap_flags(32768);
    pub const IBV_PORT_CM_SUP: ibv_port_cap_flags = ibv_port_cap_flags(65536);
    pub const IBV_PORT_SNMP_TUNNEL_SUP: ibv_port_cap_flags = ibv_port_cap_flags(131072);
    pub const IBV_PORT_REINIT_SUP: ibv_port_cap_flags = ibv_port_cap_flags(262144);
    pub const IBV_PORT_DEVICE_MGMT_SUP: ibv_port_cap_flags = ibv_port_cap_flags(524288);
    pub const IBV_PORT_VENDOR_CLASS_SUP: ibv_port_cap_flags = ibv_port_cap_flags(1048576);
    pub const IBV_PORT_DR_NOTICE_SUP: ibv_port_cap_flags = ibv_port_cap_flags(2097152);
    pub const IBV_PORT_CAP_MASK_NOTICE_SUP: ibv_port_cap_flags = ibv_port_cap_flags(4194304);
    pub const IBV_PORT_BOOT_MGMT_SUP: ibv_port_cap_flags = ibv_port_cap_flags(8388608);
    pub const IBV_PORT_LINK_LATENCY_SUP: ibv_port_cap_flags = ibv_port_cap_flags(16777216);
    pub const IBV_PORT_CLIENT_REG_SUP: ibv_port_cap_flags = ibv_port_cap_flags(33554432);
    pub const IBV_PORT_IP_BASED_GIDS: ibv_port_cap_flags = ibv_port_cap_flags(67108864);
}
impl ::std::ops::BitOr<ibv_port_cap_flags> for ibv_port_cap_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_port_cap_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_port_cap_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_port_cap_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_port_cap_flags> for ibv_port_cap_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_port_cap_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_port_cap_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_port_cap_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_port_cap_flags(pub ::std::os::raw::c_uint);
impl ibv_port_cap_flags2 {
    pub const IBV_PORT_SET_NODE_DESC_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(1);
    pub const IBV_PORT_INFO_EXT_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(2);
    pub const IBV_PORT_VIRT_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(4);
    pub const IBV_PORT_SWITCH_PORT_STATE_TABLE_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(8);
    pub const IBV_PORT_LINK_WIDTH_2X_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(16);
    pub const IBV_PORT_LINK_SPEED_HDR_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(32);
    pub const IBV_PORT_LINK_SPEED_NDR_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(1024);
    pub const IBV_PORT_LINK_SPEED_XDR_SUP: ibv_port_cap_flags2 = ibv_port_cap_flags2(4096);
}
impl ::std::ops::BitOr<ibv_port_cap_flags2> for ibv_port_cap_flags2 {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_port_cap_flags2(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_port_cap_flags2 {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_port_cap_flags2) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_port_cap_flags2> for ibv_port_cap_flags2 {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_port_cap_flags2(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_port_cap_flags2 {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_port_cap_flags2) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_port_cap_flags2(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_port_attr {
    pub state: ibv_port_state,
    pub max_mtu: ibv_mtu,
    pub active_mtu: ibv_mtu,
    pub gid_tbl_len: ::std::os::raw::c_int,
    pub port_cap_flags: u32,
    pub max_msg_sz: u32,
    pub bad_pkey_cntr: u32,
    pub qkey_viol_cntr: u32,
    pub pkey_tbl_len: u16,
    pub lid: u16,
    pub sm_lid: u16,
    pub lmc: u8,
    pub max_vl_num: u8,
    pub sm_sl: u8,
    pub subnet_timeout: u8,
    pub init_type_reply: u8,
    pub active_width: u8,
    pub active_speed: u8,
    pub phys_state: u8,
    pub link_layer: u8,
    pub flags: u8,
    pub port_cap_flags2: u16,
    pub active_speed_ex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_port_attr"][::std::mem::size_of::<ibv_port_attr>() - 56usize];
    ["Alignment of ibv_port_attr"][::std::mem::align_of::<ibv_port_attr>() - 4usize];
    ["Offset of field: ibv_port_attr::state"]
        [::std::mem::offset_of!(ibv_port_attr, state) - 0usize];
    ["Offset of field: ibv_port_attr::max_mtu"]
        [::std::mem::offset_of!(ibv_port_attr, max_mtu) - 4usize];
    ["Offset of field: ibv_port_attr::active_mtu"]
        [::std::mem::offset_of!(ibv_port_attr, active_mtu) - 8usize];
    ["Offset of field: ibv_port_attr::gid_tbl_len"]
        [::std::mem::offset_of!(ibv_port_attr, gid_tbl_len) - 12usize];
    ["Offset of field: ibv_port_attr::port_cap_flags"]
        [::std::mem::offset_of!(ibv_port_attr, port_cap_flags) - 16usize];
    ["Offset of field: ibv_port_attr::max_msg_sz"]
        [::std::mem::offset_of!(ibv_port_attr, max_msg_sz) - 20usize];
    ["Offset of field: ibv_port_attr::bad_pkey_cntr"]
        [::std::mem::offset_of!(ibv_port_attr, bad_pkey_cntr) - 24usize];
    ["Offset of field: ibv_port_attr::qkey_viol_cntr"]
        [::std::mem::offset_of!(ibv_port_attr, qkey_viol_cntr) - 28usize];
    ["Offset of field: ibv_port_attr::pkey_tbl_len"]
        [::std::mem::offset_of!(ibv_port_attr, pkey_tbl_len) - 32usize];
    ["Offset of field: ibv_port_attr::lid"][::std::mem::offset_of!(ibv_port_attr, lid) - 34usize];
    ["Offset of field: ibv_port_attr::sm_lid"]
        [::std::mem::offset_of!(ibv_port_attr, sm_lid) - 36usize];
    ["Offset of field: ibv_port_attr::lmc"][::std::mem::offset_of!(ibv_port_attr, lmc) - 38usize];
    ["Offset of field: ibv_port_attr::max_vl_num"]
        [::std::mem::offset_of!(ibv_port_attr, max_vl_num) - 39usize];
    ["Offset of field: ibv_port_attr::sm_sl"]
        [::std::mem::offset_of!(ibv_port_attr, sm_sl) - 40usize];
    ["Offset of field: ibv_port_attr::subnet_timeout"]
        [::std::mem::offset_of!(ibv_port_attr, subnet_timeout) - 41usize];
    ["Offset of field: ibv_port_attr::init_type_reply"]
        [::std::mem::offset_of!(ibv_port_attr, init_type_reply) - 42usize];
    ["Offset of field: ibv_port_attr::active_width"]
        [::std::mem::offset_of!(ibv_port_attr, active_width) - 43usize];
    ["Offset of field: ibv_port_attr::active_speed"]
        [::std::mem::offset_of!(ibv_port_attr, active_speed) - 44usize];
    ["Offset of field: ibv_port_attr::phys_state"]
        [::std::mem::offset_of!(ibv_port_attr, phys_state) - 45usize];
    ["Offset of field: ibv_port_attr::link_layer"]
        [::std::mem::offset_of!(ibv_port_attr, link_layer) - 46usize];
    ["Offset of field: ibv_port_attr::flags"]
        [::std::mem::offset_of!(ibv_port_attr, flags) - 47usize];
    ["Offset of field: ibv_port_attr::port_cap_flags2"]
        [::std::mem::offset_of!(ibv_port_attr, port_cap_flags2) - 48usize];
    ["Offset of field: ibv_port_attr::active_speed_ex"]
        [::std::mem::offset_of!(ibv_port_attr, active_speed_ex) - 52usize];
};
impl Default for ibv_port_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_event_type {
    IBV_EVENT_CQ_ERR = 0,
    IBV_EVENT_QP_FATAL = 1,
    IBV_EVENT_QP_REQ_ERR = 2,
    IBV_EVENT_QP_ACCESS_ERR = 3,
    IBV_EVENT_COMM_EST = 4,
    IBV_EVENT_SQ_DRAINED = 5,
    IBV_EVENT_PATH_MIG = 6,
    IBV_EVENT_PATH_MIG_ERR = 7,
    IBV_EVENT_DEVICE_FATAL = 8,
    IBV_EVENT_PORT_ACTIVE = 9,
    IBV_EVENT_PORT_ERR = 10,
    IBV_EVENT_LID_CHANGE = 11,
    IBV_EVENT_PKEY_CHANGE = 12,
    IBV_EVENT_SM_CHANGE = 13,
    IBV_EVENT_SRQ_ERR = 14,
    IBV_EVENT_SRQ_LIMIT_REACHED = 15,
    IBV_EVENT_QP_LAST_WQE_REACHED = 16,
    IBV_EVENT_CLIENT_REREGISTER = 17,
    IBV_EVENT_GID_CHANGE = 18,
    IBV_EVENT_WQ_FATAL = 19,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_async_event {
    pub element: ibv_async_event__bindgen_ty_1,
    pub event_type: ibv_event_type,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_async_event__bindgen_ty_1 {
    pub cq: *mut ibv_cq,
    pub qp: *mut ibv_qp,
    pub srq: *mut ibv_srq,
    pub wq: *mut ibv_wq,
    pub port_num: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_async_event__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_async_event__bindgen_ty_1>() - 8usize];
    ["Alignment of ibv_async_event__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_async_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_async_event__bindgen_ty_1::cq"]
        [::std::mem::offset_of!(ibv_async_event__bindgen_ty_1, cq) - 0usize];
    ["Offset of field: ibv_async_event__bindgen_ty_1::qp"]
        [::std::mem::offset_of!(ibv_async_event__bindgen_ty_1, qp) - 0usize];
    ["Offset of field: ibv_async_event__bindgen_ty_1::srq"]
        [::std::mem::offset_of!(ibv_async_event__bindgen_ty_1, srq) - 0usize];
    ["Offset of field: ibv_async_event__bindgen_ty_1::wq"]
        [::std::mem::offset_of!(ibv_async_event__bindgen_ty_1, wq) - 0usize];
    ["Offset of field: ibv_async_event__bindgen_ty_1::port_num"]
        [::std::mem::offset_of!(ibv_async_event__bindgen_ty_1, port_num) - 0usize];
};
impl Default for ibv_async_event__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_async_event"][::std::mem::size_of::<ibv_async_event>() - 16usize];
    ["Alignment of ibv_async_event"][::std::mem::align_of::<ibv_async_event>() - 8usize];
    ["Offset of field: ibv_async_event::element"]
        [::std::mem::offset_of!(ibv_async_event, element) - 0usize];
    ["Offset of field: ibv_async_event::event_type"]
        [::std::mem::offset_of!(ibv_async_event, event_type) - 8usize];
};
impl Default for ibv_async_event {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wc_status {
    IBV_WC_SUCCESS = 0,
    IBV_WC_LOC_LEN_ERR = 1,
    IBV_WC_LOC_QP_OP_ERR = 2,
    IBV_WC_LOC_EEC_OP_ERR = 3,
    IBV_WC_LOC_PROT_ERR = 4,
    IBV_WC_WR_FLUSH_ERR = 5,
    IBV_WC_MW_BIND_ERR = 6,
    IBV_WC_BAD_RESP_ERR = 7,
    IBV_WC_LOC_ACCESS_ERR = 8,
    IBV_WC_REM_INV_REQ_ERR = 9,
    IBV_WC_REM_ACCESS_ERR = 10,
    IBV_WC_REM_OP_ERR = 11,
    IBV_WC_RETRY_EXC_ERR = 12,
    IBV_WC_RNR_RETRY_EXC_ERR = 13,
    IBV_WC_LOC_RDD_VIOL_ERR = 14,
    IBV_WC_REM_INV_RD_REQ_ERR = 15,
    IBV_WC_REM_ABORT_ERR = 16,
    IBV_WC_INV_EECN_ERR = 17,
    IBV_WC_INV_EEC_STATE_ERR = 18,
    IBV_WC_FATAL_ERR = 19,
    IBV_WC_RESP_TIMEOUT_ERR = 20,
    IBV_WC_GENERAL_ERR = 21,
    IBV_WC_TM_ERR = 22,
    IBV_WC_TM_RNDV_INCOMPLETE = 23,
}
unsafe extern "C" {
    pub fn ibv_wc_status_str(status: ibv_wc_status) -> *const ::std::os::raw::c_char;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wc_opcode {
    IBV_WC_SEND = 0,
    IBV_WC_RDMA_WRITE = 1,
    IBV_WC_RDMA_READ = 2,
    IBV_WC_COMP_SWAP = 3,
    IBV_WC_FETCH_ADD = 4,
    IBV_WC_BIND_MW = 5,
    IBV_WC_LOCAL_INV = 6,
    IBV_WC_TSO = 7,
    IBV_WC_FLUSH = 8,
    IBV_WC_ATOMIC_WRITE = 9,
    IBV_WC_RECV = 128,
    IBV_WC_RECV_RDMA_WITH_IMM = 129,
    IBV_WC_TM_ADD = 130,
    IBV_WC_TM_DEL = 131,
    IBV_WC_TM_SYNC = 132,
    IBV_WC_TM_RECV = 133,
    IBV_WC_TM_NO_TAG = 134,
    IBV_WC_DRIVER1 = 135,
    IBV_WC_DRIVER2 = 136,
    IBV_WC_DRIVER3 = 137,
}
impl ibv_create_cq_wc_flags {
    pub const IBV_WC_EX_WITH_BYTE_LEN: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(1);
    pub const IBV_WC_EX_WITH_IMM: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(2);
    pub const IBV_WC_EX_WITH_QP_NUM: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(4);
    pub const IBV_WC_EX_WITH_SRC_QP: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(8);
    pub const IBV_WC_EX_WITH_SLID: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(16);
    pub const IBV_WC_EX_WITH_SL: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(32);
    pub const IBV_WC_EX_WITH_DLID_PATH_BITS: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(64);
    pub const IBV_WC_EX_WITH_COMPLETION_TIMESTAMP: ibv_create_cq_wc_flags =
        ibv_create_cq_wc_flags(128);
    pub const IBV_WC_EX_WITH_CVLAN: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(256);
    pub const IBV_WC_EX_WITH_FLOW_TAG: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(512);
    pub const IBV_WC_EX_WITH_TM_INFO: ibv_create_cq_wc_flags = ibv_create_cq_wc_flags(1024);
    pub const IBV_WC_EX_WITH_COMPLETION_TIMESTAMP_WALLCLOCK: ibv_create_cq_wc_flags =
        ibv_create_cq_wc_flags(2048);
}
impl ::std::ops::BitOr<ibv_create_cq_wc_flags> for ibv_create_cq_wc_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_create_cq_wc_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_create_cq_wc_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_create_cq_wc_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_create_cq_wc_flags> for ibv_create_cq_wc_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_create_cq_wc_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_create_cq_wc_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_create_cq_wc_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_create_cq_wc_flags(pub ::std::os::raw::c_uint);
impl ibv_wc_flags {
    pub const IBV_WC_GRH: ibv_wc_flags = ibv_wc_flags(1);
    pub const IBV_WC_WITH_IMM: ibv_wc_flags = ibv_wc_flags(2);
    pub const IBV_WC_IP_CSUM_OK: ibv_wc_flags = ibv_wc_flags(4);
    pub const IBV_WC_WITH_INV: ibv_wc_flags = ibv_wc_flags(8);
    pub const IBV_WC_TM_SYNC_REQ: ibv_wc_flags = ibv_wc_flags(16);
    pub const IBV_WC_TM_MATCH: ibv_wc_flags = ibv_wc_flags(32);
    pub const IBV_WC_TM_DATA_VALID: ibv_wc_flags = ibv_wc_flags(64);
}
impl ::std::ops::BitOr<ibv_wc_flags> for ibv_wc_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_wc_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_wc_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_wc_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_wc_flags> for ibv_wc_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_wc_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_wc_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_wc_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_wc_flags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_wc__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidated_rkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_wc__bindgen_ty_1"][::std::mem::size_of::<ibv_wc__bindgen_ty_1>() - 4usize];
    ["Alignment of ibv_wc__bindgen_ty_1"][::std::mem::align_of::<ibv_wc__bindgen_ty_1>() - 4usize];
    ["Offset of field: ibv_wc__bindgen_ty_1::imm_data"]
        [::std::mem::offset_of!(ibv_wc__bindgen_ty_1, imm_data) - 0usize];
    ["Offset of field: ibv_wc__bindgen_ty_1::invalidated_rkey"]
        [::std::mem::offset_of!(ibv_wc__bindgen_ty_1, invalidated_rkey) - 0usize];
};
impl Default for ibv_wc__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ibv_access_flags {
    pub const IBV_ACCESS_LOCAL_WRITE: ibv_access_flags = ibv_access_flags(1);
    pub const IBV_ACCESS_REMOTE_WRITE: ibv_access_flags = ibv_access_flags(2);
    pub const IBV_ACCESS_REMOTE_READ: ibv_access_flags = ibv_access_flags(4);
    pub const IBV_ACCESS_REMOTE_ATOMIC: ibv_access_flags = ibv_access_flags(8);
    pub const IBV_ACCESS_MW_BIND: ibv_access_flags = ibv_access_flags(16);
    pub const IBV_ACCESS_ZERO_BASED: ibv_access_flags = ibv_access_flags(32);
    pub const IBV_ACCESS_ON_DEMAND: ibv_access_flags = ibv_access_flags(64);
    pub const IBV_ACCESS_HUGETLB: ibv_access_flags = ibv_access_flags(128);
    pub const IBV_ACCESS_FLUSH_GLOBAL: ibv_access_flags = ibv_access_flags(256);
    pub const IBV_ACCESS_FLUSH_PERSISTENT: ibv_access_flags = ibv_access_flags(512);
    pub const IBV_ACCESS_RELAXED_ORDERING: ibv_access_flags = ibv_access_flags(1048576);
}
impl ::std::ops::BitOr<ibv_access_flags> for ibv_access_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_access_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_access_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_access_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_access_flags> for ibv_access_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_access_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_access_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_access_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_access_flags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_mw_bind_info {
    pub mr: *mut ibv_mr,
    pub addr: u64,
    pub length: u64,
    pub mw_access_flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_mw_bind_info"][::std::mem::size_of::<ibv_mw_bind_info>() - 32usize];
    ["Alignment of ibv_mw_bind_info"][::std::mem::align_of::<ibv_mw_bind_info>() - 8usize];
    ["Offset of field: ibv_mw_bind_info::mr"]
        [::std::mem::offset_of!(ibv_mw_bind_info, mr) - 0usize];
    ["Offset of field: ibv_mw_bind_info::addr"]
        [::std::mem::offset_of!(ibv_mw_bind_info, addr) - 8usize];
    ["Offset of field: ibv_mw_bind_info::length"]
        [::std::mem::offset_of!(ibv_mw_bind_info, length) - 16usize];
    ["Offset of field: ibv_mw_bind_info::mw_access_flags"]
        [::std::mem::offset_of!(ibv_mw_bind_info, mw_access_flags) - 24usize];
};
impl Default for ibv_mw_bind_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_pd {
    pub context: *mut ibv_context,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_pd"][::std::mem::size_of::<ibv_pd>() - 16usize];
    ["Alignment of ibv_pd"][::std::mem::align_of::<ibv_pd>() - 8usize];
    ["Offset of field: ibv_pd::context"][::std::mem::offset_of!(ibv_pd, context) - 0usize];
    ["Offset of field: ibv_pd::handle"][::std::mem::offset_of!(ibv_pd, handle) - 8usize];
};
impl Default for ibv_pd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_td_init_attr {
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_td_init_attr"][::std::mem::size_of::<ibv_td_init_attr>() - 4usize];
    ["Alignment of ibv_td_init_attr"][::std::mem::align_of::<ibv_td_init_attr>() - 4usize];
    ["Offset of field: ibv_td_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_td_init_attr, comp_mask) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_td {
    pub context: *mut ibv_context,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_td"][::std::mem::size_of::<ibv_td>() - 8usize];
    ["Alignment of ibv_td"][::std::mem::align_of::<ibv_td>() - 8usize];
    ["Offset of field: ibv_td::context"][::std::mem::offset_of!(ibv_td, context) - 0usize];
};
impl Default for ibv_td {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ibv_xrcd_init_attr_mask {
    pub const IBV_XRCD_INIT_ATTR_FD: ibv_xrcd_init_attr_mask = ibv_xrcd_init_attr_mask(1);
    pub const IBV_XRCD_INIT_ATTR_OFLAGS: ibv_xrcd_init_attr_mask = ibv_xrcd_init_attr_mask(2);
    pub const IBV_XRCD_INIT_ATTR_RESERVED: ibv_xrcd_init_attr_mask = ibv_xrcd_init_attr_mask(4);
}
impl ::std::ops::BitOr<ibv_xrcd_init_attr_mask> for ibv_xrcd_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_xrcd_init_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_xrcd_init_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_xrcd_init_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_xrcd_init_attr_mask> for ibv_xrcd_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_xrcd_init_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_xrcd_init_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_xrcd_init_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_xrcd_init_attr_mask(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_xrcd_init_attr {
    pub comp_mask: u32,
    pub fd: ::std::os::raw::c_int,
    pub oflags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_xrcd_init_attr"][::std::mem::size_of::<ibv_xrcd_init_attr>() - 12usize];
    ["Alignment of ibv_xrcd_init_attr"][::std::mem::align_of::<ibv_xrcd_init_attr>() - 4usize];
    ["Offset of field: ibv_xrcd_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_xrcd_init_attr, comp_mask) - 0usize];
    ["Offset of field: ibv_xrcd_init_attr::fd"]
        [::std::mem::offset_of!(ibv_xrcd_init_attr, fd) - 4usize];
    ["Offset of field: ibv_xrcd_init_attr::oflags"]
        [::std::mem::offset_of!(ibv_xrcd_init_attr, oflags) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_xrcd {
    pub context: *mut ibv_context,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_xrcd"][::std::mem::size_of::<ibv_xrcd>() - 8usize];
    ["Alignment of ibv_xrcd"][::std::mem::align_of::<ibv_xrcd>() - 8usize];
    ["Offset of field: ibv_xrcd::context"][::std::mem::offset_of!(ibv_xrcd, context) - 0usize];
};
impl Default for ibv_xrcd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_rereg_mr_flags {
    IBV_REREG_MR_CHANGE_TRANSLATION = 1,
    IBV_REREG_MR_CHANGE_PD = 2,
    IBV_REREG_MR_CHANGE_ACCESS = 4,
    IBV_REREG_MR_FLAGS_SUPPORTED = 7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_mr {
    pub context: *mut ibv_context,
    pub pd: *mut ibv_pd,
    pub addr: *mut ::std::os::raw::c_void,
    pub length: usize,
    pub handle: u32,
    pub lkey: u32,
    pub rkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_mr"][::std::mem::size_of::<ibv_mr>() - 48usize];
    ["Alignment of ibv_mr"][::std::mem::align_of::<ibv_mr>() - 8usize];
    ["Offset of field: ibv_mr::context"][::std::mem::offset_of!(ibv_mr, context) - 0usize];
    ["Offset of field: ibv_mr::pd"][::std::mem::offset_of!(ibv_mr, pd) - 8usize];
    ["Offset of field: ibv_mr::addr"][::std::mem::offset_of!(ibv_mr, addr) - 16usize];
    ["Offset of field: ibv_mr::length"][::std::mem::offset_of!(ibv_mr, length) - 24usize];
    ["Offset of field: ibv_mr::handle"][::std::mem::offset_of!(ibv_mr, handle) - 32usize];
    ["Offset of field: ibv_mr::lkey"][::std::mem::offset_of!(ibv_mr, lkey) - 36usize];
    ["Offset of field: ibv_mr::rkey"][::std::mem::offset_of!(ibv_mr, rkey) - 40usize];
};
impl Default for ibv_mr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_mw_type {
    IBV_MW_TYPE_1 = 1,
    IBV_MW_TYPE_2 = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_mw {
    pub context: *mut ibv_context,
    pub pd: *mut ibv_pd,
    pub rkey: u32,
    pub handle: u32,
    pub type_: ibv_mw_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_mw"][::std::mem::size_of::<ibv_mw>() - 32usize];
    ["Alignment of ibv_mw"][::std::mem::align_of::<ibv_mw>() - 8usize];
    ["Offset of field: ibv_mw::context"][::std::mem::offset_of!(ibv_mw, context) - 0usize];
    ["Offset of field: ibv_mw::pd"][::std::mem::offset_of!(ibv_mw, pd) - 8usize];
    ["Offset of field: ibv_mw::rkey"][::std::mem::offset_of!(ibv_mw, rkey) - 16usize];
    ["Offset of field: ibv_mw::handle"][::std::mem::offset_of!(ibv_mw, handle) - 20usize];
    ["Offset of field: ibv_mw::type_"][::std::mem::offset_of!(ibv_mw, type_) - 24usize];
};
impl Default for ibv_mw {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_global_route {
    pub dgid: ibv_gid,
    pub flow_label: u32,
    pub sgid_index: u8,
    pub hop_limit: u8,
    pub traffic_class: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_global_route"][::std::mem::size_of::<ibv_global_route>() - 24usize];
    ["Alignment of ibv_global_route"][::std::mem::align_of::<ibv_global_route>() - 8usize];
    ["Offset of field: ibv_global_route::dgid"]
        [::std::mem::offset_of!(ibv_global_route, dgid) - 0usize];
    ["Offset of field: ibv_global_route::flow_label"]
        [::std::mem::offset_of!(ibv_global_route, flow_label) - 16usize];
    ["Offset of field: ibv_global_route::sgid_index"]
        [::std::mem::offset_of!(ibv_global_route, sgid_index) - 20usize];
    ["Offset of field: ibv_global_route::hop_limit"]
        [::std::mem::offset_of!(ibv_global_route, hop_limit) - 21usize];
    ["Offset of field: ibv_global_route::traffic_class"]
        [::std::mem::offset_of!(ibv_global_route, traffic_class) - 22usize];
};
impl Default for ibv_global_route {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_grh {
    pub version_tclass_flow: __be32,
    pub paylen: __be16,
    pub next_hdr: u8,
    pub hop_limit: u8,
    pub sgid: ibv_gid,
    pub dgid: ibv_gid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_grh"][::std::mem::size_of::<ibv_grh>() - 40usize];
    ["Alignment of ibv_grh"][::std::mem::align_of::<ibv_grh>() - 8usize];
    ["Offset of field: ibv_grh::version_tclass_flow"]
        [::std::mem::offset_of!(ibv_grh, version_tclass_flow) - 0usize];
    ["Offset of field: ibv_grh::paylen"][::std::mem::offset_of!(ibv_grh, paylen) - 4usize];
    ["Offset of field: ibv_grh::next_hdr"][::std::mem::offset_of!(ibv_grh, next_hdr) - 6usize];
    ["Offset of field: ibv_grh::hop_limit"][::std::mem::offset_of!(ibv_grh, hop_limit) - 7usize];
    ["Offset of field: ibv_grh::sgid"][::std::mem::offset_of!(ibv_grh, sgid) - 8usize];
    ["Offset of field: ibv_grh::dgid"][::std::mem::offset_of!(ibv_grh, dgid) - 24usize];
};
impl Default for ibv_grh {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_rate {
    IBV_RATE_MAX = 0,
    IBV_RATE_2_5_GBPS = 2,
    IBV_RATE_5_GBPS = 5,
    IBV_RATE_10_GBPS = 3,
    IBV_RATE_20_GBPS = 6,
    IBV_RATE_30_GBPS = 4,
    IBV_RATE_40_GBPS = 7,
    IBV_RATE_60_GBPS = 8,
    IBV_RATE_80_GBPS = 9,
    IBV_RATE_120_GBPS = 10,
    IBV_RATE_14_GBPS = 11,
    IBV_RATE_56_GBPS = 12,
    IBV_RATE_112_GBPS = 13,
    IBV_RATE_168_GBPS = 14,
    IBV_RATE_25_GBPS = 15,
    IBV_RATE_100_GBPS = 16,
    IBV_RATE_200_GBPS = 17,
    IBV_RATE_300_GBPS = 18,
    IBV_RATE_28_GBPS = 19,
    IBV_RATE_50_GBPS = 20,
    IBV_RATE_400_GBPS = 21,
    IBV_RATE_600_GBPS = 22,
    IBV_RATE_800_GBPS = 23,
    IBV_RATE_1200_GBPS = 24,
}
unsafe extern "C" {
    #[doc = " ibv_rate_to_mult - Convert the IB rate enum to a multiple of the\n base rate of 2.5 Gbit/sec.  For example, IBV_RATE_5_GBPS will be\n converted to 2, since 5 Gbit/sec is 2 * 2.5 Gbit/sec.\n @rate: rate to convert."]
    pub fn ibv_rate_to_mult(rate: ibv_rate) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " ibv_rate_to_mbps - Convert the IB rate enum to Mbit/sec.\n For example, IBV_RATE_5_GBPS will return the value 5000.\n @rate: rate to convert."]
    pub fn ibv_rate_to_mbps(rate: ibv_rate) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_ah_attr {
    pub grh: ibv_global_route,
    pub dlid: u16,
    pub sl: u8,
    pub src_path_bits: u8,
    pub static_rate: u8,
    pub is_global: u8,
    pub port_num: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ah_attr"][::std::mem::size_of::<ibv_ah_attr>() - 32usize];
    ["Alignment of ibv_ah_attr"][::std::mem::align_of::<ibv_ah_attr>() - 8usize];
    ["Offset of field: ibv_ah_attr::grh"][::std::mem::offset_of!(ibv_ah_attr, grh) - 0usize];
    ["Offset of field: ibv_ah_attr::dlid"][::std::mem::offset_of!(ibv_ah_attr, dlid) - 24usize];
    ["Offset of field: ibv_ah_attr::sl"][::std::mem::offset_of!(ibv_ah_attr, sl) - 26usize];
    ["Offset of field: ibv_ah_attr::src_path_bits"]
        [::std::mem::offset_of!(ibv_ah_attr, src_path_bits) - 27usize];
    ["Offset of field: ibv_ah_attr::static_rate"]
        [::std::mem::offset_of!(ibv_ah_attr, static_rate) - 28usize];
    ["Offset of field: ibv_ah_attr::is_global"]
        [::std::mem::offset_of!(ibv_ah_attr, is_global) - 29usize];
    ["Offset of field: ibv_ah_attr::port_num"]
        [::std::mem::offset_of!(ibv_ah_attr, port_num) - 30usize];
};
impl Default for ibv_ah_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_srq_attr_mask {
    IBV_SRQ_MAX_WR = 1,
    IBV_SRQ_LIMIT = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_srq_attr {
    pub max_wr: u32,
    pub max_sge: u32,
    pub srq_limit: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_srq_attr"][::std::mem::size_of::<ibv_srq_attr>() - 12usize];
    ["Alignment of ibv_srq_attr"][::std::mem::align_of::<ibv_srq_attr>() - 4usize];
    ["Offset of field: ibv_srq_attr::max_wr"]
        [::std::mem::offset_of!(ibv_srq_attr, max_wr) - 0usize];
    ["Offset of field: ibv_srq_attr::max_sge"]
        [::std::mem::offset_of!(ibv_srq_attr, max_sge) - 4usize];
    ["Offset of field: ibv_srq_attr::srq_limit"]
        [::std::mem::offset_of!(ibv_srq_attr, srq_limit) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_srq_init_attr {
    pub srq_context: *mut ::std::os::raw::c_void,
    pub attr: ibv_srq_attr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_srq_init_attr"][::std::mem::size_of::<ibv_srq_init_attr>() - 24usize];
    ["Alignment of ibv_srq_init_attr"][::std::mem::align_of::<ibv_srq_init_attr>() - 8usize];
    ["Offset of field: ibv_srq_init_attr::srq_context"]
        [::std::mem::offset_of!(ibv_srq_init_attr, srq_context) - 0usize];
    ["Offset of field: ibv_srq_init_attr::attr"]
        [::std::mem::offset_of!(ibv_srq_init_attr, attr) - 8usize];
};
impl Default for ibv_srq_init_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_srq_type {
    IBV_SRQT_BASIC = 0,
    IBV_SRQT_XRC = 1,
    IBV_SRQT_TM = 2,
}
impl ibv_srq_init_attr_mask {
    pub const IBV_SRQ_INIT_ATTR_TYPE: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(1);
    pub const IBV_SRQ_INIT_ATTR_PD: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(2);
    pub const IBV_SRQ_INIT_ATTR_XRCD: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(4);
    pub const IBV_SRQ_INIT_ATTR_CQ: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(8);
    pub const IBV_SRQ_INIT_ATTR_TM: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(16);
    pub const IBV_SRQ_INIT_ATTR_RESERVED: ibv_srq_init_attr_mask = ibv_srq_init_attr_mask(32);
}
impl ::std::ops::BitOr<ibv_srq_init_attr_mask> for ibv_srq_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_srq_init_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_srq_init_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_srq_init_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_srq_init_attr_mask> for ibv_srq_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_srq_init_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_srq_init_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_srq_init_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_srq_init_attr_mask(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_tm_cap {
    pub max_num_tags: u32,
    pub max_ops: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_tm_cap"][::std::mem::size_of::<ibv_tm_cap>() - 8usize];
    ["Alignment of ibv_tm_cap"][::std::mem::align_of::<ibv_tm_cap>() - 4usize];
    ["Offset of field: ibv_tm_cap::max_num_tags"]
        [::std::mem::offset_of!(ibv_tm_cap, max_num_tags) - 0usize];
    ["Offset of field: ibv_tm_cap::max_ops"][::std::mem::offset_of!(ibv_tm_cap, max_ops) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_srq_init_attr_ex {
    pub srq_context: *mut ::std::os::raw::c_void,
    pub attr: ibv_srq_attr,
    pub comp_mask: u32,
    pub srq_type: ibv_srq_type,
    pub pd: *mut ibv_pd,
    pub xrcd: *mut ibv_xrcd,
    pub cq: *mut ibv_cq,
    pub tm_cap: ibv_tm_cap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_srq_init_attr_ex"][::std::mem::size_of::<ibv_srq_init_attr_ex>() - 64usize];
    ["Alignment of ibv_srq_init_attr_ex"][::std::mem::align_of::<ibv_srq_init_attr_ex>() - 8usize];
    ["Offset of field: ibv_srq_init_attr_ex::srq_context"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, srq_context) - 0usize];
    ["Offset of field: ibv_srq_init_attr_ex::attr"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, attr) - 8usize];
    ["Offset of field: ibv_srq_init_attr_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, comp_mask) - 20usize];
    ["Offset of field: ibv_srq_init_attr_ex::srq_type"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, srq_type) - 24usize];
    ["Offset of field: ibv_srq_init_attr_ex::pd"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, pd) - 32usize];
    ["Offset of field: ibv_srq_init_attr_ex::xrcd"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, xrcd) - 40usize];
    ["Offset of field: ibv_srq_init_attr_ex::cq"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, cq) - 48usize];
    ["Offset of field: ibv_srq_init_attr_ex::tm_cap"]
        [::std::mem::offset_of!(ibv_srq_init_attr_ex, tm_cap) - 56usize];
};
impl Default for ibv_srq_init_attr_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wq_type {
    IBV_WQT_RQ = 0,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wq_init_attr_mask {
    IBV_WQ_INIT_ATTR_FLAGS = 1,
    IBV_WQ_INIT_ATTR_RESERVED = 2,
}
impl ibv_wq_flags {
    pub const IBV_WQ_FLAGS_CVLAN_STRIPPING: ibv_wq_flags = ibv_wq_flags(1);
    pub const IBV_WQ_FLAGS_SCATTER_FCS: ibv_wq_flags = ibv_wq_flags(2);
    pub const IBV_WQ_FLAGS_DELAY_DROP: ibv_wq_flags = ibv_wq_flags(4);
    pub const IBV_WQ_FLAGS_PCI_WRITE_END_PADDING: ibv_wq_flags = ibv_wq_flags(8);
    pub const IBV_WQ_FLAGS_RESERVED: ibv_wq_flags = ibv_wq_flags(16);
}
impl ::std::ops::BitOr<ibv_wq_flags> for ibv_wq_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_wq_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_wq_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_wq_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_wq_flags> for ibv_wq_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_wq_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_wq_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_wq_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_wq_flags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_wq_init_attr {
    pub wq_context: *mut ::std::os::raw::c_void,
    pub wq_type: ibv_wq_type,
    pub max_wr: u32,
    pub max_sge: u32,
    pub pd: *mut ibv_pd,
    pub cq: *mut ibv_cq,
    pub comp_mask: u32,
    pub create_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_wq_init_attr"][::std::mem::size_of::<ibv_wq_init_attr>() - 48usize];
    ["Alignment of ibv_wq_init_attr"][::std::mem::align_of::<ibv_wq_init_attr>() - 8usize];
    ["Offset of field: ibv_wq_init_attr::wq_context"]
        [::std::mem::offset_of!(ibv_wq_init_attr, wq_context) - 0usize];
    ["Offset of field: ibv_wq_init_attr::wq_type"]
        [::std::mem::offset_of!(ibv_wq_init_attr, wq_type) - 8usize];
    ["Offset of field: ibv_wq_init_attr::max_wr"]
        [::std::mem::offset_of!(ibv_wq_init_attr, max_wr) - 12usize];
    ["Offset of field: ibv_wq_init_attr::max_sge"]
        [::std::mem::offset_of!(ibv_wq_init_attr, max_sge) - 16usize];
    ["Offset of field: ibv_wq_init_attr::pd"]
        [::std::mem::offset_of!(ibv_wq_init_attr, pd) - 24usize];
    ["Offset of field: ibv_wq_init_attr::cq"]
        [::std::mem::offset_of!(ibv_wq_init_attr, cq) - 32usize];
    ["Offset of field: ibv_wq_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_wq_init_attr, comp_mask) - 40usize];
    ["Offset of field: ibv_wq_init_attr::create_flags"]
        [::std::mem::offset_of!(ibv_wq_init_attr, create_flags) - 44usize];
};
impl Default for ibv_wq_init_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wq_state {
    IBV_WQS_RESET = 0,
    IBV_WQS_RDY = 1,
    IBV_WQS_ERR = 2,
    IBV_WQS_UNKNOWN = 3,
}
impl ibv_wq_attr_mask {
    pub const IBV_WQ_ATTR_STATE: ibv_wq_attr_mask = ibv_wq_attr_mask(1);
    pub const IBV_WQ_ATTR_CURR_STATE: ibv_wq_attr_mask = ibv_wq_attr_mask(2);
    pub const IBV_WQ_ATTR_FLAGS: ibv_wq_attr_mask = ibv_wq_attr_mask(4);
    pub const IBV_WQ_ATTR_RESERVED: ibv_wq_attr_mask = ibv_wq_attr_mask(8);
}
impl ::std::ops::BitOr<ibv_wq_attr_mask> for ibv_wq_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_wq_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_wq_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_wq_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_wq_attr_mask> for ibv_wq_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_wq_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_wq_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_wq_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_wq_attr_mask(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_wq_attr {
    pub attr_mask: u32,
    pub wq_state: ibv_wq_state,
    pub curr_wq_state: ibv_wq_state,
    pub flags: u32,
    pub flags_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_wq_attr"][::std::mem::size_of::<ibv_wq_attr>() - 20usize];
    ["Alignment of ibv_wq_attr"][::std::mem::align_of::<ibv_wq_attr>() - 4usize];
    ["Offset of field: ibv_wq_attr::attr_mask"]
        [::std::mem::offset_of!(ibv_wq_attr, attr_mask) - 0usize];
    ["Offset of field: ibv_wq_attr::wq_state"]
        [::std::mem::offset_of!(ibv_wq_attr, wq_state) - 4usize];
    ["Offset of field: ibv_wq_attr::curr_wq_state"]
        [::std::mem::offset_of!(ibv_wq_attr, curr_wq_state) - 8usize];
    ["Offset of field: ibv_wq_attr::flags"][::std::mem::offset_of!(ibv_wq_attr, flags) - 12usize];
    ["Offset of field: ibv_wq_attr::flags_mask"]
        [::std::mem::offset_of!(ibv_wq_attr, flags_mask) - 16usize];
};
impl Default for ibv_wq_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_rwq_ind_table {
    pub context: *mut ibv_context,
    pub ind_tbl_handle: ::std::os::raw::c_int,
    pub ind_tbl_num: ::std::os::raw::c_int,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_rwq_ind_table"][::std::mem::size_of::<ibv_rwq_ind_table>() - 24usize];
    ["Alignment of ibv_rwq_ind_table"][::std::mem::align_of::<ibv_rwq_ind_table>() - 8usize];
    ["Offset of field: ibv_rwq_ind_table::context"]
        [::std::mem::offset_of!(ibv_rwq_ind_table, context) - 0usize];
    ["Offset of field: ibv_rwq_ind_table::ind_tbl_handle"]
        [::std::mem::offset_of!(ibv_rwq_ind_table, ind_tbl_handle) - 8usize];
    ["Offset of field: ibv_rwq_ind_table::ind_tbl_num"]
        [::std::mem::offset_of!(ibv_rwq_ind_table, ind_tbl_num) - 12usize];
    ["Offset of field: ibv_rwq_ind_table::comp_mask"]
        [::std::mem::offset_of!(ibv_rwq_ind_table, comp_mask) - 16usize];
};
impl Default for ibv_rwq_ind_table {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_ind_table_init_attr_mask {
    IBV_CREATE_IND_TABLE_RESERVED = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_rwq_ind_table_init_attr {
    pub log_ind_tbl_size: u32,
    pub ind_tbl: *mut *mut ibv_wq,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_rwq_ind_table_init_attr"]
        [::std::mem::size_of::<ibv_rwq_ind_table_init_attr>() - 24usize];
    ["Alignment of ibv_rwq_ind_table_init_attr"]
        [::std::mem::align_of::<ibv_rwq_ind_table_init_attr>() - 8usize];
    ["Offset of field: ibv_rwq_ind_table_init_attr::log_ind_tbl_size"]
        [::std::mem::offset_of!(ibv_rwq_ind_table_init_attr, log_ind_tbl_size) - 0usize];
    ["Offset of field: ibv_rwq_ind_table_init_attr::ind_tbl"]
        [::std::mem::offset_of!(ibv_rwq_ind_table_init_attr, ind_tbl) - 8usize];
    ["Offset of field: ibv_rwq_ind_table_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_rwq_ind_table_init_attr, comp_mask) - 16usize];
};
impl Default for ibv_rwq_ind_table_init_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_qp_type {
    IBV_QPT_RC = 2,
    IBV_QPT_UC = 3,
    IBV_QPT_UD = 4,
    IBV_QPT_RAW_PACKET = 8,
    IBV_QPT_XRC_SEND = 9,
    IBV_QPT_XRC_RECV = 10,
    IBV_QPT_DRIVER = 255,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_qp_cap {
    pub max_send_wr: u32,
    pub max_recv_wr: u32,
    pub max_send_sge: u32,
    pub max_recv_sge: u32,
    pub max_inline_data: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_cap"][::std::mem::size_of::<ibv_qp_cap>() - 20usize];
    ["Alignment of ibv_qp_cap"][::std::mem::align_of::<ibv_qp_cap>() - 4usize];
    ["Offset of field: ibv_qp_cap::max_send_wr"]
        [::std::mem::offset_of!(ibv_qp_cap, max_send_wr) - 0usize];
    ["Offset of field: ibv_qp_cap::max_recv_wr"]
        [::std::mem::offset_of!(ibv_qp_cap, max_recv_wr) - 4usize];
    ["Offset of field: ibv_qp_cap::max_send_sge"]
        [::std::mem::offset_of!(ibv_qp_cap, max_send_sge) - 8usize];
    ["Offset of field: ibv_qp_cap::max_recv_sge"]
        [::std::mem::offset_of!(ibv_qp_cap, max_recv_sge) - 12usize];
    ["Offset of field: ibv_qp_cap::max_inline_data"]
        [::std::mem::offset_of!(ibv_qp_cap, max_inline_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_qp_init_attr {
    pub qp_context: *mut ::std::os::raw::c_void,
    pub send_cq: *mut ibv_cq,
    pub recv_cq: *mut ibv_cq,
    pub srq: *mut ibv_srq,
    pub cap: ibv_qp_cap,
    pub qp_type: ibv_qp_type,
    pub sq_sig_all: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_init_attr"][::std::mem::size_of::<ibv_qp_init_attr>() - 64usize];
    ["Alignment of ibv_qp_init_attr"][::std::mem::align_of::<ibv_qp_init_attr>() - 8usize];
    ["Offset of field: ibv_qp_init_attr::qp_context"]
        [::std::mem::offset_of!(ibv_qp_init_attr, qp_context) - 0usize];
    ["Offset of field: ibv_qp_init_attr::send_cq"]
        [::std::mem::offset_of!(ibv_qp_init_attr, send_cq) - 8usize];
    ["Offset of field: ibv_qp_init_attr::recv_cq"]
        [::std::mem::offset_of!(ibv_qp_init_attr, recv_cq) - 16usize];
    ["Offset of field: ibv_qp_init_attr::srq"]
        [::std::mem::offset_of!(ibv_qp_init_attr, srq) - 24usize];
    ["Offset of field: ibv_qp_init_attr::cap"]
        [::std::mem::offset_of!(ibv_qp_init_attr, cap) - 32usize];
    ["Offset of field: ibv_qp_init_attr::qp_type"]
        [::std::mem::offset_of!(ibv_qp_init_attr, qp_type) - 52usize];
    ["Offset of field: ibv_qp_init_attr::sq_sig_all"]
        [::std::mem::offset_of!(ibv_qp_init_attr, sq_sig_all) - 56usize];
};
impl Default for ibv_qp_init_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ibv_qp_init_attr_mask {
    pub const IBV_QP_INIT_ATTR_PD: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(1);
    pub const IBV_QP_INIT_ATTR_XRCD: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(2);
    pub const IBV_QP_INIT_ATTR_CREATE_FLAGS: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(4);
    pub const IBV_QP_INIT_ATTR_MAX_TSO_HEADER: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(8);
    pub const IBV_QP_INIT_ATTR_IND_TABLE: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(16);
    pub const IBV_QP_INIT_ATTR_RX_HASH: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(32);
    pub const IBV_QP_INIT_ATTR_SEND_OPS_FLAGS: ibv_qp_init_attr_mask = ibv_qp_init_attr_mask(64);
}
impl ::std::ops::BitOr<ibv_qp_init_attr_mask> for ibv_qp_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_qp_init_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_qp_init_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_qp_init_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_qp_init_attr_mask> for ibv_qp_init_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_qp_init_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_qp_init_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_qp_init_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_qp_init_attr_mask(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_qp_create_flags {
    IBV_QP_CREATE_BLOCK_SELF_MCAST_LB = 2,
    IBV_QP_CREATE_SCATTER_FCS = 256,
    IBV_QP_CREATE_CVLAN_STRIPPING = 512,
    IBV_QP_CREATE_SOURCE_QPN = 1024,
    IBV_QP_CREATE_PCI_WRITE_END_PADDING = 2048,
}
impl ibv_qp_create_send_ops_flags {
    pub const IBV_QP_EX_WITH_RDMA_WRITE: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(1);
    pub const IBV_QP_EX_WITH_RDMA_WRITE_WITH_IMM: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(2);
    pub const IBV_QP_EX_WITH_SEND: ibv_qp_create_send_ops_flags = ibv_qp_create_send_ops_flags(4);
    pub const IBV_QP_EX_WITH_SEND_WITH_IMM: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(8);
    pub const IBV_QP_EX_WITH_RDMA_READ: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(16);
    pub const IBV_QP_EX_WITH_ATOMIC_CMP_AND_SWP: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(32);
    pub const IBV_QP_EX_WITH_ATOMIC_FETCH_AND_ADD: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(64);
    pub const IBV_QP_EX_WITH_LOCAL_INV: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(128);
    pub const IBV_QP_EX_WITH_BIND_MW: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(256);
    pub const IBV_QP_EX_WITH_SEND_WITH_INV: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(512);
    pub const IBV_QP_EX_WITH_TSO: ibv_qp_create_send_ops_flags = ibv_qp_create_send_ops_flags(1024);
    pub const IBV_QP_EX_WITH_FLUSH: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(2048);
    pub const IBV_QP_EX_WITH_ATOMIC_WRITE: ibv_qp_create_send_ops_flags =
        ibv_qp_create_send_ops_flags(4096);
}
impl ::std::ops::BitOr<ibv_qp_create_send_ops_flags> for ibv_qp_create_send_ops_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_qp_create_send_ops_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_qp_create_send_ops_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_qp_create_send_ops_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_qp_create_send_ops_flags> for ibv_qp_create_send_ops_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_qp_create_send_ops_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_qp_create_send_ops_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_qp_create_send_ops_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_qp_create_send_ops_flags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_rx_hash_conf {
    pub rx_hash_function: u8,
    pub rx_hash_key_len: u8,
    pub rx_hash_key: *mut u8,
    pub rx_hash_fields_mask: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_rx_hash_conf"][::std::mem::size_of::<ibv_rx_hash_conf>() - 24usize];
    ["Alignment of ibv_rx_hash_conf"][::std::mem::align_of::<ibv_rx_hash_conf>() - 8usize];
    ["Offset of field: ibv_rx_hash_conf::rx_hash_function"]
        [::std::mem::offset_of!(ibv_rx_hash_conf, rx_hash_function) - 0usize];
    ["Offset of field: ibv_rx_hash_conf::rx_hash_key_len"]
        [::std::mem::offset_of!(ibv_rx_hash_conf, rx_hash_key_len) - 1usize];
    ["Offset of field: ibv_rx_hash_conf::rx_hash_key"]
        [::std::mem::offset_of!(ibv_rx_hash_conf, rx_hash_key) - 8usize];
    ["Offset of field: ibv_rx_hash_conf::rx_hash_fields_mask"]
        [::std::mem::offset_of!(ibv_rx_hash_conf, rx_hash_fields_mask) - 16usize];
};
impl Default for ibv_rx_hash_conf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_qp_init_attr_ex {
    pub qp_context: *mut ::std::os::raw::c_void,
    pub send_cq: *mut ibv_cq,
    pub recv_cq: *mut ibv_cq,
    pub srq: *mut ibv_srq,
    pub cap: ibv_qp_cap,
    pub qp_type: ibv_qp_type,
    pub sq_sig_all: ::std::os::raw::c_int,
    pub comp_mask: u32,
    pub pd: *mut ibv_pd,
    pub xrcd: *mut ibv_xrcd,
    pub create_flags: u32,
    pub max_tso_header: u16,
    pub rwq_ind_tbl: *mut ibv_rwq_ind_table,
    pub rx_hash_conf: ibv_rx_hash_conf,
    pub source_qpn: u32,
    pub send_ops_flags: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_init_attr_ex"][::std::mem::size_of::<ibv_qp_init_attr_ex>() - 136usize];
    ["Alignment of ibv_qp_init_attr_ex"][::std::mem::align_of::<ibv_qp_init_attr_ex>() - 8usize];
    ["Offset of field: ibv_qp_init_attr_ex::qp_context"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, qp_context) - 0usize];
    ["Offset of field: ibv_qp_init_attr_ex::send_cq"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, send_cq) - 8usize];
    ["Offset of field: ibv_qp_init_attr_ex::recv_cq"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, recv_cq) - 16usize];
    ["Offset of field: ibv_qp_init_attr_ex::srq"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, srq) - 24usize];
    ["Offset of field: ibv_qp_init_attr_ex::cap"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, cap) - 32usize];
    ["Offset of field: ibv_qp_init_attr_ex::qp_type"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, qp_type) - 52usize];
    ["Offset of field: ibv_qp_init_attr_ex::sq_sig_all"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, sq_sig_all) - 56usize];
    ["Offset of field: ibv_qp_init_attr_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, comp_mask) - 60usize];
    ["Offset of field: ibv_qp_init_attr_ex::pd"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, pd) - 64usize];
    ["Offset of field: ibv_qp_init_attr_ex::xrcd"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, xrcd) - 72usize];
    ["Offset of field: ibv_qp_init_attr_ex::create_flags"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, create_flags) - 80usize];
    ["Offset of field: ibv_qp_init_attr_ex::max_tso_header"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, max_tso_header) - 84usize];
    ["Offset of field: ibv_qp_init_attr_ex::rwq_ind_tbl"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, rwq_ind_tbl) - 88usize];
    ["Offset of field: ibv_qp_init_attr_ex::rx_hash_conf"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, rx_hash_conf) - 96usize];
    ["Offset of field: ibv_qp_init_attr_ex::source_qpn"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, source_qpn) - 120usize];
    ["Offset of field: ibv_qp_init_attr_ex::send_ops_flags"]
        [::std::mem::offset_of!(ibv_qp_init_attr_ex, send_ops_flags) - 128usize];
};
impl Default for ibv_qp_init_attr_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ibv_qp_open_attr_mask {
    pub const IBV_QP_OPEN_ATTR_NUM: ibv_qp_open_attr_mask = ibv_qp_open_attr_mask(1);
    pub const IBV_QP_OPEN_ATTR_XRCD: ibv_qp_open_attr_mask = ibv_qp_open_attr_mask(2);
    pub const IBV_QP_OPEN_ATTR_CONTEXT: ibv_qp_open_attr_mask = ibv_qp_open_attr_mask(4);
    pub const IBV_QP_OPEN_ATTR_TYPE: ibv_qp_open_attr_mask = ibv_qp_open_attr_mask(8);
    pub const IBV_QP_OPEN_ATTR_RESERVED: ibv_qp_open_attr_mask = ibv_qp_open_attr_mask(16);
}
impl ::std::ops::BitOr<ibv_qp_open_attr_mask> for ibv_qp_open_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_qp_open_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_qp_open_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_qp_open_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_qp_open_attr_mask> for ibv_qp_open_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_qp_open_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_qp_open_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_qp_open_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_qp_open_attr_mask(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_qp_open_attr {
    pub comp_mask: u32,
    pub qp_num: u32,
    pub xrcd: *mut ibv_xrcd,
    pub qp_context: *mut ::std::os::raw::c_void,
    pub qp_type: ibv_qp_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_open_attr"][::std::mem::size_of::<ibv_qp_open_attr>() - 32usize];
    ["Alignment of ibv_qp_open_attr"][::std::mem::align_of::<ibv_qp_open_attr>() - 8usize];
    ["Offset of field: ibv_qp_open_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_qp_open_attr, comp_mask) - 0usize];
    ["Offset of field: ibv_qp_open_attr::qp_num"]
        [::std::mem::offset_of!(ibv_qp_open_attr, qp_num) - 4usize];
    ["Offset of field: ibv_qp_open_attr::xrcd"]
        [::std::mem::offset_of!(ibv_qp_open_attr, xrcd) - 8usize];
    ["Offset of field: ibv_qp_open_attr::qp_context"]
        [::std::mem::offset_of!(ibv_qp_open_attr, qp_context) - 16usize];
    ["Offset of field: ibv_qp_open_attr::qp_type"]
        [::std::mem::offset_of!(ibv_qp_open_attr, qp_type) - 24usize];
};
impl Default for ibv_qp_open_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ibv_qp_attr_mask {
    pub const IBV_QP_STATE: ibv_qp_attr_mask = ibv_qp_attr_mask(1);
    pub const IBV_QP_CUR_STATE: ibv_qp_attr_mask = ibv_qp_attr_mask(2);
    pub const IBV_QP_EN_SQD_ASYNC_NOTIFY: ibv_qp_attr_mask = ibv_qp_attr_mask(4);
    pub const IBV_QP_ACCESS_FLAGS: ibv_qp_attr_mask = ibv_qp_attr_mask(8);
    pub const IBV_QP_PKEY_INDEX: ibv_qp_attr_mask = ibv_qp_attr_mask(16);
    pub const IBV_QP_PORT: ibv_qp_attr_mask = ibv_qp_attr_mask(32);
    pub const IBV_QP_QKEY: ibv_qp_attr_mask = ibv_qp_attr_mask(64);
    pub const IBV_QP_AV: ibv_qp_attr_mask = ibv_qp_attr_mask(128);
    pub const IBV_QP_PATH_MTU: ibv_qp_attr_mask = ibv_qp_attr_mask(256);
    pub const IBV_QP_TIMEOUT: ibv_qp_attr_mask = ibv_qp_attr_mask(512);
    pub const IBV_QP_RETRY_CNT: ibv_qp_attr_mask = ibv_qp_attr_mask(1024);
    pub const IBV_QP_RNR_RETRY: ibv_qp_attr_mask = ibv_qp_attr_mask(2048);
    pub const IBV_QP_RQ_PSN: ibv_qp_attr_mask = ibv_qp_attr_mask(4096);
    pub const IBV_QP_MAX_QP_RD_ATOMIC: ibv_qp_attr_mask = ibv_qp_attr_mask(8192);
    pub const IBV_QP_ALT_PATH: ibv_qp_attr_mask = ibv_qp_attr_mask(16384);
    pub const IBV_QP_MIN_RNR_TIMER: ibv_qp_attr_mask = ibv_qp_attr_mask(32768);
    pub const IBV_QP_SQ_PSN: ibv_qp_attr_mask = ibv_qp_attr_mask(65536);
    pub const IBV_QP_MAX_DEST_RD_ATOMIC: ibv_qp_attr_mask = ibv_qp_attr_mask(131072);
    pub const IBV_QP_PATH_MIG_STATE: ibv_qp_attr_mask = ibv_qp_attr_mask(262144);
    pub const IBV_QP_CAP: ibv_qp_attr_mask = ibv_qp_attr_mask(524288);
    pub const IBV_QP_DEST_QPN: ibv_qp_attr_mask = ibv_qp_attr_mask(1048576);
    pub const IBV_QP_RATE_LIMIT: ibv_qp_attr_mask = ibv_qp_attr_mask(33554432);
}
impl ::std::ops::BitOr<ibv_qp_attr_mask> for ibv_qp_attr_mask {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_qp_attr_mask(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_qp_attr_mask {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_qp_attr_mask) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_qp_attr_mask> for ibv_qp_attr_mask {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_qp_attr_mask(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_qp_attr_mask {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_qp_attr_mask) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_qp_attr_mask(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_query_qp_data_in_order_flags {
    IBV_QUERY_QP_DATA_IN_ORDER_RETURN_CAPS = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_query_qp_data_in_order_caps {
    IBV_QUERY_QP_DATA_IN_ORDER_WHOLE_MSG = 1,
    IBV_QUERY_QP_DATA_IN_ORDER_ALIGNED_128_BYTES = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_qp_state {
    IBV_QPS_RESET = 0,
    IBV_QPS_INIT = 1,
    IBV_QPS_RTR = 2,
    IBV_QPS_RTS = 3,
    IBV_QPS_SQD = 4,
    IBV_QPS_SQE = 5,
    IBV_QPS_ERR = 6,
    IBV_QPS_UNKNOWN = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_mig_state {
    IBV_MIG_MIGRATED = 0,
    IBV_MIG_REARM = 1,
    IBV_MIG_ARMED = 2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_qp_attr {
    pub qp_state: ibv_qp_state,
    pub cur_qp_state: ibv_qp_state,
    pub path_mtu: ibv_mtu,
    pub path_mig_state: ibv_mig_state,
    pub qkey: u32,
    pub rq_psn: u32,
    pub sq_psn: u32,
    pub dest_qp_num: u32,
    pub qp_access_flags: ::std::os::raw::c_uint,
    pub cap: ibv_qp_cap,
    pub ah_attr: ibv_ah_attr,
    pub alt_ah_attr: ibv_ah_attr,
    pub pkey_index: u16,
    pub alt_pkey_index: u16,
    pub en_sqd_async_notify: u8,
    pub sq_draining: u8,
    pub max_rd_atomic: u8,
    pub max_dest_rd_atomic: u8,
    pub min_rnr_timer: u8,
    pub port_num: u8,
    pub timeout: u8,
    pub retry_cnt: u8,
    pub rnr_retry: u8,
    pub alt_port_num: u8,
    pub alt_timeout: u8,
    pub rate_limit: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_attr"][::std::mem::size_of::<ibv_qp_attr>() - 144usize];
    ["Alignment of ibv_qp_attr"][::std::mem::align_of::<ibv_qp_attr>() - 8usize];
    ["Offset of field: ibv_qp_attr::qp_state"]
        [::std::mem::offset_of!(ibv_qp_attr, qp_state) - 0usize];
    ["Offset of field: ibv_qp_attr::cur_qp_state"]
        [::std::mem::offset_of!(ibv_qp_attr, cur_qp_state) - 4usize];
    ["Offset of field: ibv_qp_attr::path_mtu"]
        [::std::mem::offset_of!(ibv_qp_attr, path_mtu) - 8usize];
    ["Offset of field: ibv_qp_attr::path_mig_state"]
        [::std::mem::offset_of!(ibv_qp_attr, path_mig_state) - 12usize];
    ["Offset of field: ibv_qp_attr::qkey"][::std::mem::offset_of!(ibv_qp_attr, qkey) - 16usize];
    ["Offset of field: ibv_qp_attr::rq_psn"][::std::mem::offset_of!(ibv_qp_attr, rq_psn) - 20usize];
    ["Offset of field: ibv_qp_attr::sq_psn"][::std::mem::offset_of!(ibv_qp_attr, sq_psn) - 24usize];
    ["Offset of field: ibv_qp_attr::dest_qp_num"]
        [::std::mem::offset_of!(ibv_qp_attr, dest_qp_num) - 28usize];
    ["Offset of field: ibv_qp_attr::qp_access_flags"]
        [::std::mem::offset_of!(ibv_qp_attr, qp_access_flags) - 32usize];
    ["Offset of field: ibv_qp_attr::cap"][::std::mem::offset_of!(ibv_qp_attr, cap) - 36usize];
    ["Offset of field: ibv_qp_attr::ah_attr"]
        [::std::mem::offset_of!(ibv_qp_attr, ah_attr) - 56usize];
    ["Offset of field: ibv_qp_attr::alt_ah_attr"]
        [::std::mem::offset_of!(ibv_qp_attr, alt_ah_attr) - 88usize];
    ["Offset of field: ibv_qp_attr::pkey_index"]
        [::std::mem::offset_of!(ibv_qp_attr, pkey_index) - 120usize];
    ["Offset of field: ibv_qp_attr::alt_pkey_index"]
        [::std::mem::offset_of!(ibv_qp_attr, alt_pkey_index) - 122usize];
    ["Offset of field: ibv_qp_attr::en_sqd_async_notify"]
        [::std::mem::offset_of!(ibv_qp_attr, en_sqd_async_notify) - 124usize];
    ["Offset of field: ibv_qp_attr::sq_draining"]
        [::std::mem::offset_of!(ibv_qp_attr, sq_draining) - 125usize];
    ["Offset of field: ibv_qp_attr::max_rd_atomic"]
        [::std::mem::offset_of!(ibv_qp_attr, max_rd_atomic) - 126usize];
    ["Offset of field: ibv_qp_attr::max_dest_rd_atomic"]
        [::std::mem::offset_of!(ibv_qp_attr, max_dest_rd_atomic) - 127usize];
    ["Offset of field: ibv_qp_attr::min_rnr_timer"]
        [::std::mem::offset_of!(ibv_qp_attr, min_rnr_timer) - 128usize];
    ["Offset of field: ibv_qp_attr::port_num"]
        [::std::mem::offset_of!(ibv_qp_attr, port_num) - 129usize];
    ["Offset of field: ibv_qp_attr::timeout"]
        [::std::mem::offset_of!(ibv_qp_attr, timeout) - 130usize];
    ["Offset of field: ibv_qp_attr::retry_cnt"]
        [::std::mem::offset_of!(ibv_qp_attr, retry_cnt) - 131usize];
    ["Offset of field: ibv_qp_attr::rnr_retry"]
        [::std::mem::offset_of!(ibv_qp_attr, rnr_retry) - 132usize];
    ["Offset of field: ibv_qp_attr::alt_port_num"]
        [::std::mem::offset_of!(ibv_qp_attr, alt_port_num) - 133usize];
    ["Offset of field: ibv_qp_attr::alt_timeout"]
        [::std::mem::offset_of!(ibv_qp_attr, alt_timeout) - 134usize];
    ["Offset of field: ibv_qp_attr::rate_limit"]
        [::std::mem::offset_of!(ibv_qp_attr, rate_limit) - 136usize];
};
impl Default for ibv_qp_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_qp_rate_limit_attr {
    pub rate_limit: u32,
    pub max_burst_sz: u32,
    pub typical_pkt_sz: u16,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_rate_limit_attr"][::std::mem::size_of::<ibv_qp_rate_limit_attr>() - 16usize];
    ["Alignment of ibv_qp_rate_limit_attr"]
        [::std::mem::align_of::<ibv_qp_rate_limit_attr>() - 4usize];
    ["Offset of field: ibv_qp_rate_limit_attr::rate_limit"]
        [::std::mem::offset_of!(ibv_qp_rate_limit_attr, rate_limit) - 0usize];
    ["Offset of field: ibv_qp_rate_limit_attr::max_burst_sz"]
        [::std::mem::offset_of!(ibv_qp_rate_limit_attr, max_burst_sz) - 4usize];
    ["Offset of field: ibv_qp_rate_limit_attr::typical_pkt_sz"]
        [::std::mem::offset_of!(ibv_qp_rate_limit_attr, typical_pkt_sz) - 8usize];
    ["Offset of field: ibv_qp_rate_limit_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_qp_rate_limit_attr, comp_mask) - 12usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_wr_opcode {
    IBV_WR_RDMA_WRITE = 0,
    IBV_WR_RDMA_WRITE_WITH_IMM = 1,
    IBV_WR_SEND = 2,
    IBV_WR_SEND_WITH_IMM = 3,
    IBV_WR_RDMA_READ = 4,
    IBV_WR_ATOMIC_CMP_AND_SWP = 5,
    IBV_WR_ATOMIC_FETCH_AND_ADD = 6,
    IBV_WR_LOCAL_INV = 7,
    IBV_WR_BIND_MW = 8,
    IBV_WR_SEND_WITH_INV = 9,
    IBV_WR_TSO = 10,
    IBV_WR_DRIVER1 = 11,
    IBV_WR_FLUSH = 14,
    IBV_WR_ATOMIC_WRITE = 15,
}
unsafe extern "C" {
    pub fn ibv_wr_opcode_str(opcode: ibv_wr_opcode) -> *const ::std::os::raw::c_char;
}
impl ibv_send_flags {
    pub const IBV_SEND_FENCE: ibv_send_flags = ibv_send_flags(1);
    pub const IBV_SEND_SIGNALED: ibv_send_flags = ibv_send_flags(2);
    pub const IBV_SEND_SOLICITED: ibv_send_flags = ibv_send_flags(4);
    pub const IBV_SEND_INLINE: ibv_send_flags = ibv_send_flags(8);
    pub const IBV_SEND_IP_CSUM: ibv_send_flags = ibv_send_flags(16);
}
impl ::std::ops::BitOr<ibv_send_flags> for ibv_send_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ibv_send_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ibv_send_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ibv_send_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ibv_send_flags> for ibv_send_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ibv_send_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ibv_send_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ibv_send_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ibv_send_flags(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_placement_type {
    IBV_FLUSH_GLOBAL = 1,
    IBV_FLUSH_PERSISTENT = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_selectivity_level {
    IBV_FLUSH_RANGE = 0,
    IBV_FLUSH_MR = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_data_buf {
    pub addr: *mut ::std::os::raw::c_void,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_data_buf"][::std::mem::size_of::<ibv_data_buf>() - 16usize];
    ["Alignment of ibv_data_buf"][::std::mem::align_of::<ibv_data_buf>() - 8usize];
    ["Offset of field: ibv_data_buf::addr"][::std::mem::offset_of!(ibv_data_buf, addr) - 0usize];
    ["Offset of field: ibv_data_buf::length"]
        [::std::mem::offset_of!(ibv_data_buf, length) - 8usize];
};
impl Default for ibv_data_buf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_sge {
    pub addr: u64,
    pub length: u32,
    pub lkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_sge"][::std::mem::size_of::<ibv_sge>() - 16usize];
    ["Alignment of ibv_sge"][::std::mem::align_of::<ibv_sge>() - 8usize];
    ["Offset of field: ibv_sge::addr"][::std::mem::offset_of!(ibv_sge, addr) - 0usize];
    ["Offset of field: ibv_sge::length"][::std::mem::offset_of!(ibv_sge, length) - 8usize];
    ["Offset of field: ibv_sge::lkey"][::std::mem::offset_of!(ibv_sge, lkey) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_send_wr {
    pub wr_id: u64,
    pub next: *mut ibv_send_wr,
    pub sg_list: *mut ibv_sge,
    pub num_sge: ::std::os::raw::c_int,
    pub opcode: ibv_wr_opcode,
    pub send_flags: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: ibv_send_wr__bindgen_ty_1,
    pub wr: ibv_send_wr__bindgen_ty_2,
    pub qp_type: ibv_send_wr__bindgen_ty_3,
    pub __bindgen_anon_2: ibv_send_wr__bindgen_ty_4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_send_wr__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidate_rkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_1>() - 4usize];
    ["Alignment of ibv_send_wr__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_1>() - 4usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_1::imm_data"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_1, imm_data) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_1::invalidate_rkey"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_1, invalidate_rkey) - 0usize];
};
impl Default for ibv_send_wr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_send_wr__bindgen_ty_2 {
    pub rdma: ibv_send_wr__bindgen_ty_2__bindgen_ty_1,
    pub atomic: ibv_send_wr__bindgen_ty_2__bindgen_ty_2,
    pub ud: ibv_send_wr__bindgen_ty_2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_2__bindgen_ty_1 {
    pub remote_addr: u64,
    pub rkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_1>() - 16usize];
    ["Alignment of ibv_send_wr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_1::remote_addr"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_1, remote_addr) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_1::rkey"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_1, rkey) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_2__bindgen_ty_2 {
    pub remote_addr: u64,
    pub compare_add: u64,
    pub swap: u64,
    pub rkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_2>() - 32usize];
    ["Alignment of ibv_send_wr__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_2>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_2::remote_addr"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_2, remote_addr) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_2::compare_add"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_2, compare_add) - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_2::swap"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_2, swap) - 16usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_2::rkey"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_2, rkey) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_2__bindgen_ty_3 {
    pub ah: *mut ibv_ah,
    pub remote_qpn: u32,
    pub remote_qkey: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_3>() - 16usize];
    ["Alignment of ibv_send_wr__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_2__bindgen_ty_3>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_3::ah"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_3, ah) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_3::remote_qpn"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_3, remote_qpn) - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2__bindgen_ty_3::remote_qkey"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2__bindgen_ty_3, remote_qkey) - 12usize];
};
impl Default for ibv_send_wr__bindgen_ty_2__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_2"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_2>() - 32usize];
    ["Alignment of ibv_send_wr__bindgen_ty_2"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_2>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2::rdma"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2, rdma) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2::atomic"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2, atomic) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_2::ud"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_2, ud) - 0usize];
};
impl Default for ibv_send_wr__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_send_wr__bindgen_ty_3 {
    pub xrc: ibv_send_wr__bindgen_ty_3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_3__bindgen_ty_1 {
    pub remote_srqn: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_3__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_3__bindgen_ty_1>() - 4usize];
    ["Alignment of ibv_send_wr__bindgen_ty_3__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_3__bindgen_ty_1>() - 4usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_3__bindgen_ty_1::remote_srqn"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_3__bindgen_ty_1, remote_srqn) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_3"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_3>() - 4usize];
    ["Alignment of ibv_send_wr__bindgen_ty_3"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_3>() - 4usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_3::xrc"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_3, xrc) - 0usize];
};
impl Default for ibv_send_wr__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_send_wr__bindgen_ty_4 {
    pub bind_mw: ibv_send_wr__bindgen_ty_4__bindgen_ty_1,
    pub tso: ibv_send_wr__bindgen_ty_4__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_4__bindgen_ty_1 {
    pub mw: *mut ibv_mw,
    pub rkey: u32,
    pub bind_info: ibv_mw_bind_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_4__bindgen_ty_1>() - 48usize];
    ["Alignment of ibv_send_wr__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_4__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_1::mw"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_1, mw) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_1::rkey"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_1, rkey) - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_1::bind_info"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_1, bind_info) - 16usize];
};
impl Default for ibv_send_wr__bindgen_ty_4__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_send_wr__bindgen_ty_4__bindgen_ty_2 {
    pub hdr: *mut ::std::os::raw::c_void,
    pub hdr_sz: u16,
    pub mss: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_4__bindgen_ty_2"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_4__bindgen_ty_2>() - 16usize];
    ["Alignment of ibv_send_wr__bindgen_ty_4__bindgen_ty_2"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_4__bindgen_ty_2>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_2::hdr"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_2, hdr) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_2::hdr_sz"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_2, hdr_sz) - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4__bindgen_ty_2::mss"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4__bindgen_ty_2, mss) - 10usize];
};
impl Default for ibv_send_wr__bindgen_ty_4__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr__bindgen_ty_4"]
        [::std::mem::size_of::<ibv_send_wr__bindgen_ty_4>() - 48usize];
    ["Alignment of ibv_send_wr__bindgen_ty_4"]
        [::std::mem::align_of::<ibv_send_wr__bindgen_ty_4>() - 8usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4::bind_mw"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4, bind_mw) - 0usize];
    ["Offset of field: ibv_send_wr__bindgen_ty_4::tso"]
        [::std::mem::offset_of!(ibv_send_wr__bindgen_ty_4, tso) - 0usize];
};
impl Default for ibv_send_wr__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_send_wr"][::std::mem::size_of::<ibv_send_wr>() - 128usize];
    ["Alignment of ibv_send_wr"][::std::mem::align_of::<ibv_send_wr>() - 8usize];
    ["Offset of field: ibv_send_wr::wr_id"][::std::mem::offset_of!(ibv_send_wr, wr_id) - 0usize];
    ["Offset of field: ibv_send_wr::next"][::std::mem::offset_of!(ibv_send_wr, next) - 8usize];
    ["Offset of field: ibv_send_wr::sg_list"]
        [::std::mem::offset_of!(ibv_send_wr, sg_list) - 16usize];
    ["Offset of field: ibv_send_wr::num_sge"]
        [::std::mem::offset_of!(ibv_send_wr, num_sge) - 24usize];
    ["Offset of field: ibv_send_wr::opcode"][::std::mem::offset_of!(ibv_send_wr, opcode) - 28usize];
    ["Offset of field: ibv_send_wr::send_flags"]
        [::std::mem::offset_of!(ibv_send_wr, send_flags) - 32usize];
    ["Offset of field: ibv_send_wr::wr"][::std::mem::offset_of!(ibv_send_wr, wr) - 40usize];
    ["Offset of field: ibv_send_wr::qp_type"]
        [::std::mem::offset_of!(ibv_send_wr, qp_type) - 72usize];
};
impl Default for ibv_send_wr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_recv_wr {
    pub wr_id: u64,
    pub next: *mut ibv_recv_wr,
    pub sg_list: *mut ibv_sge,
    pub num_sge: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_recv_wr"][::std::mem::size_of::<ibv_recv_wr>() - 32usize];
    ["Alignment of ibv_recv_wr"][::std::mem::align_of::<ibv_recv_wr>() - 8usize];
    ["Offset of field: ibv_recv_wr::wr_id"][::std::mem::offset_of!(ibv_recv_wr, wr_id) - 0usize];
    ["Offset of field: ibv_recv_wr::next"][::std::mem::offset_of!(ibv_recv_wr, next) - 8usize];
    ["Offset of field: ibv_recv_wr::sg_list"]
        [::std::mem::offset_of!(ibv_recv_wr, sg_list) - 16usize];
    ["Offset of field: ibv_recv_wr::num_sge"]
        [::std::mem::offset_of!(ibv_recv_wr, num_sge) - 24usize];
};
impl Default for ibv_recv_wr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_ops_wr_opcode {
    IBV_WR_TAG_ADD = 0,
    IBV_WR_TAG_DEL = 1,
    IBV_WR_TAG_SYNC = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_ops_flags {
    IBV_OPS_SIGNALED = 1,
    IBV_OPS_TM_SYNC = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_ops_wr {
    pub wr_id: u64,
    pub next: *mut ibv_ops_wr,
    pub opcode: ibv_ops_wr_opcode,
    pub flags: ::std::os::raw::c_int,
    pub tm: ibv_ops_wr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_ops_wr__bindgen_ty_1 {
    pub unexpected_cnt: u32,
    pub handle: u32,
    pub add: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_ops_wr__bindgen_ty_1__bindgen_ty_1 {
    pub recv_wr_id: u64,
    pub sg_list: *mut ibv_sge,
    pub num_sge: ::std::os::raw::c_int,
    pub tag: u64,
    pub mask: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ops_wr__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_ops_wr__bindgen_ty_1__bindgen_ty_1>() - 40usize];
    ["Alignment of ibv_ops_wr__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_ops_wr__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1::recv_wr_id"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1__bindgen_ty_1, recv_wr_id) - 0usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1::sg_list"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1__bindgen_ty_1, sg_list) - 8usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1::num_sge"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1__bindgen_ty_1, num_sge) - 16usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1::tag"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1__bindgen_ty_1, tag) - 24usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1__bindgen_ty_1::mask"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1__bindgen_ty_1, mask) - 32usize];
};
impl Default for ibv_ops_wr__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ops_wr__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_ops_wr__bindgen_ty_1>() - 48usize];
    ["Alignment of ibv_ops_wr__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_ops_wr__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1::unexpected_cnt"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1, unexpected_cnt) - 0usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1::handle"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1, handle) - 4usize];
    ["Offset of field: ibv_ops_wr__bindgen_ty_1::add"]
        [::std::mem::offset_of!(ibv_ops_wr__bindgen_ty_1, add) - 8usize];
};
impl Default for ibv_ops_wr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ops_wr"][::std::mem::size_of::<ibv_ops_wr>() - 72usize];
    ["Alignment of ibv_ops_wr"][::std::mem::align_of::<ibv_ops_wr>() - 8usize];
    ["Offset of field: ibv_ops_wr::wr_id"][::std::mem::offset_of!(ibv_ops_wr, wr_id) - 0usize];
    ["Offset of field: ibv_ops_wr::next"][::std::mem::offset_of!(ibv_ops_wr, next) - 8usize];
    ["Offset of field: ibv_ops_wr::opcode"][::std::mem::offset_of!(ibv_ops_wr, opcode) - 16usize];
    ["Offset of field: ibv_ops_wr::flags"][::std::mem::offset_of!(ibv_ops_wr, flags) - 20usize];
    ["Offset of field: ibv_ops_wr::tm"][::std::mem::offset_of!(ibv_ops_wr, tm) - 24usize];
};
impl Default for ibv_ops_wr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_mw_bind {
    pub wr_id: u64,
    pub send_flags: ::std::os::raw::c_uint,
    pub bind_info: ibv_mw_bind_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_mw_bind"][::std::mem::size_of::<ibv_mw_bind>() - 48usize];
    ["Alignment of ibv_mw_bind"][::std::mem::align_of::<ibv_mw_bind>() - 8usize];
    ["Offset of field: ibv_mw_bind::wr_id"][::std::mem::offset_of!(ibv_mw_bind, wr_id) - 0usize];
    ["Offset of field: ibv_mw_bind::send_flags"]
        [::std::mem::offset_of!(ibv_mw_bind, send_flags) - 8usize];
    ["Offset of field: ibv_mw_bind::bind_info"]
        [::std::mem::offset_of!(ibv_mw_bind, bind_info) - 16usize];
};
impl Default for ibv_mw_bind {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_srq {
    pub context: *mut ibv_context,
    pub srq_context: *mut ::std::os::raw::c_void,
    pub pd: *mut ibv_pd,
    pub handle: u32,
    pub mutex: pthread_mutex_t,
    pub cond: pthread_cond_t,
    pub events_completed: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_srq"][::std::mem::size_of::<ibv_srq>() - 128usize];
    ["Alignment of ibv_srq"][::std::mem::align_of::<ibv_srq>() - 8usize];
    ["Offset of field: ibv_srq::context"][::std::mem::offset_of!(ibv_srq, context) - 0usize];
    ["Offset of field: ibv_srq::srq_context"]
        [::std::mem::offset_of!(ibv_srq, srq_context) - 8usize];
    ["Offset of field: ibv_srq::pd"][::std::mem::offset_of!(ibv_srq, pd) - 16usize];
    ["Offset of field: ibv_srq::handle"][::std::mem::offset_of!(ibv_srq, handle) - 24usize];
    ["Offset of field: ibv_srq::mutex"][::std::mem::offset_of!(ibv_srq, mutex) - 32usize];
    ["Offset of field: ibv_srq::cond"][::std::mem::offset_of!(ibv_srq, cond) - 72usize];
    ["Offset of field: ibv_srq::events_completed"]
        [::std::mem::offset_of!(ibv_srq, events_completed) - 120usize];
};
impl Default for ibv_srq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_wq {
    pub context: *mut ibv_context,
    pub wq_context: *mut ::std::os::raw::c_void,
    pub pd: *mut ibv_pd,
    pub cq: *mut ibv_cq,
    pub wq_num: u32,
    pub handle: u32,
    pub state: ibv_wq_state,
    pub wq_type: ibv_wq_type,
    pub post_recv: ::std::option::Option<
        unsafe extern "C" fn(
            current: *mut ibv_wq,
            recv_wr: *mut ibv_recv_wr,
            bad_recv_wr: *mut *mut ibv_recv_wr,
        ) -> ::std::os::raw::c_int,
    >,
    pub mutex: pthread_mutex_t,
    pub cond: pthread_cond_t,
    pub events_completed: u32,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_wq"][::std::mem::size_of::<ibv_wq>() - 152usize];
    ["Alignment of ibv_wq"][::std::mem::align_of::<ibv_wq>() - 8usize];
    ["Offset of field: ibv_wq::context"][::std::mem::offset_of!(ibv_wq, context) - 0usize];
    ["Offset of field: ibv_wq::wq_context"][::std::mem::offset_of!(ibv_wq, wq_context) - 8usize];
    ["Offset of field: ibv_wq::pd"][::std::mem::offset_of!(ibv_wq, pd) - 16usize];
    ["Offset of field: ibv_wq::cq"][::std::mem::offset_of!(ibv_wq, cq) - 24usize];
    ["Offset of field: ibv_wq::wq_num"][::std::mem::offset_of!(ibv_wq, wq_num) - 32usize];
    ["Offset of field: ibv_wq::handle"][::std::mem::offset_of!(ibv_wq, handle) - 36usize];
    ["Offset of field: ibv_wq::state"][::std::mem::offset_of!(ibv_wq, state) - 40usize];
    ["Offset of field: ibv_wq::wq_type"][::std::mem::offset_of!(ibv_wq, wq_type) - 44usize];
    ["Offset of field: ibv_wq::post_recv"][::std::mem::offset_of!(ibv_wq, post_recv) - 48usize];
    ["Offset of field: ibv_wq::mutex"][::std::mem::offset_of!(ibv_wq, mutex) - 56usize];
    ["Offset of field: ibv_wq::cond"][::std::mem::offset_of!(ibv_wq, cond) - 96usize];
    ["Offset of field: ibv_wq::events_completed"]
        [::std::mem::offset_of!(ibv_wq, events_completed) - 144usize];
    ["Offset of field: ibv_wq::comp_mask"][::std::mem::offset_of!(ibv_wq, comp_mask) - 148usize];
};
impl Default for ibv_wq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_qp {
    pub context: *mut ibv_context,
    pub qp_context: *mut ::std::os::raw::c_void,
    pub pd: *mut ibv_pd,
    pub send_cq: *mut ibv_cq,
    pub recv_cq: *mut ibv_cq,
    pub srq: *mut ibv_srq,
    pub handle: u32,
    pub qp_num: u32,
    pub state: ibv_qp_state,
    pub qp_type: ibv_qp_type,
    pub mutex: pthread_mutex_t,
    pub cond: pthread_cond_t,
    pub events_completed: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp"][::std::mem::size_of::<ibv_qp>() - 160usize];
    ["Alignment of ibv_qp"][::std::mem::align_of::<ibv_qp>() - 8usize];
    ["Offset of field: ibv_qp::context"][::std::mem::offset_of!(ibv_qp, context) - 0usize];
    ["Offset of field: ibv_qp::qp_context"][::std::mem::offset_of!(ibv_qp, qp_context) - 8usize];
    ["Offset of field: ibv_qp::pd"][::std::mem::offset_of!(ibv_qp, pd) - 16usize];
    ["Offset of field: ibv_qp::send_cq"][::std::mem::offset_of!(ibv_qp, send_cq) - 24usize];
    ["Offset of field: ibv_qp::recv_cq"][::std::mem::offset_of!(ibv_qp, recv_cq) - 32usize];
    ["Offset of field: ibv_qp::srq"][::std::mem::offset_of!(ibv_qp, srq) - 40usize];
    ["Offset of field: ibv_qp::handle"][::std::mem::offset_of!(ibv_qp, handle) - 48usize];
    ["Offset of field: ibv_qp::qp_num"][::std::mem::offset_of!(ibv_qp, qp_num) - 52usize];
    ["Offset of field: ibv_qp::state"][::std::mem::offset_of!(ibv_qp, state) - 56usize];
    ["Offset of field: ibv_qp::qp_type"][::std::mem::offset_of!(ibv_qp, qp_type) - 60usize];
    ["Offset of field: ibv_qp::mutex"][::std::mem::offset_of!(ibv_qp, mutex) - 64usize];
    ["Offset of field: ibv_qp::cond"][::std::mem::offset_of!(ibv_qp, cond) - 104usize];
    ["Offset of field: ibv_qp::events_completed"]
        [::std::mem::offset_of!(ibv_qp, events_completed) - 152usize];
};
impl Default for ibv_qp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_qp_ex {
    pub qp_base: ibv_qp,
    pub comp_mask: u64,
    pub wr_id: u64,
    pub wr_flags: ::std::os::raw::c_uint,
    pub wr_atomic_cmp_swp: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            rkey: u32,
            remote_addr: u64,
            compare: u64,
            swap: u64,
        ),
    >,
    pub wr_atomic_fetch_add: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, rkey: u32, remote_addr: u64, add: u64),
    >,
    pub wr_bind_mw: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            mw: *mut ibv_mw,
            rkey: u32,
            bind_info: *const ibv_mw_bind_info,
        ),
    >,
    pub wr_local_inv:
        ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex, invalidate_rkey: u32)>,
    pub wr_rdma_read: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, rkey: u32, remote_addr: u64),
    >,
    pub wr_rdma_write: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, rkey: u32, remote_addr: u64),
    >,
    pub wr_rdma_write_imm: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, rkey: u32, remote_addr: u64, imm_data: __be32),
    >,
    pub wr_send: ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex)>,
    pub wr_send_imm:
        ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex, imm_data: __be32)>,
    pub wr_send_inv:
        ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex, invalidate_rkey: u32)>,
    pub wr_send_tso: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            hdr: *mut ::std::os::raw::c_void,
            hdr_sz: u16,
            mss: u16,
        ),
    >,
    pub wr_set_ud_addr: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            ah: *mut ibv_ah,
            remote_qpn: u32,
            remote_qkey: u32,
        ),
    >,
    pub wr_set_xrc_srqn:
        ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex, remote_srqn: u32)>,
    pub wr_set_inline_data: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, addr: *mut ::std::os::raw::c_void, length: usize),
    >,
    pub wr_set_inline_data_list: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, num_buf: usize, buf_list: *const ibv_data_buf),
    >,
    pub wr_set_sge: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, lkey: u32, addr: u64, length: u32),
    >,
    pub wr_set_sge_list: ::std::option::Option<
        unsafe extern "C" fn(qp: *mut ibv_qp_ex, num_sge: usize, sg_list: *const ibv_sge),
    >,
    pub wr_start: ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex)>,
    pub wr_complete:
        ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex) -> ::std::os::raw::c_int>,
    pub wr_abort: ::std::option::Option<unsafe extern "C" fn(qp: *mut ibv_qp_ex)>,
    pub wr_atomic_write: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            rkey: u32,
            remote_addr: u64,
            atomic_wr: *const ::std::os::raw::c_void,
        ),
    >,
    pub wr_flush: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp_ex,
            rkey: u32,
            remote_addr: u64,
            len: usize,
            type_: u8,
            level: u8,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_qp_ex"][::std::mem::size_of::<ibv_qp_ex>() - 360usize];
    ["Alignment of ibv_qp_ex"][::std::mem::align_of::<ibv_qp_ex>() - 8usize];
    ["Offset of field: ibv_qp_ex::qp_base"][::std::mem::offset_of!(ibv_qp_ex, qp_base) - 0usize];
    ["Offset of field: ibv_qp_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_qp_ex, comp_mask) - 160usize];
    ["Offset of field: ibv_qp_ex::wr_id"][::std::mem::offset_of!(ibv_qp_ex, wr_id) - 168usize];
    ["Offset of field: ibv_qp_ex::wr_flags"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_flags) - 176usize];
    ["Offset of field: ibv_qp_ex::wr_atomic_cmp_swp"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_atomic_cmp_swp) - 184usize];
    ["Offset of field: ibv_qp_ex::wr_atomic_fetch_add"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_atomic_fetch_add) - 192usize];
    ["Offset of field: ibv_qp_ex::wr_bind_mw"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_bind_mw) - 200usize];
    ["Offset of field: ibv_qp_ex::wr_local_inv"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_local_inv) - 208usize];
    ["Offset of field: ibv_qp_ex::wr_rdma_read"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_rdma_read) - 216usize];
    ["Offset of field: ibv_qp_ex::wr_rdma_write"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_rdma_write) - 224usize];
    ["Offset of field: ibv_qp_ex::wr_rdma_write_imm"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_rdma_write_imm) - 232usize];
    ["Offset of field: ibv_qp_ex::wr_send"][::std::mem::offset_of!(ibv_qp_ex, wr_send) - 240usize];
    ["Offset of field: ibv_qp_ex::wr_send_imm"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_send_imm) - 248usize];
    ["Offset of field: ibv_qp_ex::wr_send_inv"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_send_inv) - 256usize];
    ["Offset of field: ibv_qp_ex::wr_send_tso"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_send_tso) - 264usize];
    ["Offset of field: ibv_qp_ex::wr_set_ud_addr"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_ud_addr) - 272usize];
    ["Offset of field: ibv_qp_ex::wr_set_xrc_srqn"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_xrc_srqn) - 280usize];
    ["Offset of field: ibv_qp_ex::wr_set_inline_data"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_inline_data) - 288usize];
    ["Offset of field: ibv_qp_ex::wr_set_inline_data_list"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_inline_data_list) - 296usize];
    ["Offset of field: ibv_qp_ex::wr_set_sge"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_sge) - 304usize];
    ["Offset of field: ibv_qp_ex::wr_set_sge_list"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_set_sge_list) - 312usize];
    ["Offset of field: ibv_qp_ex::wr_start"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_start) - 320usize];
    ["Offset of field: ibv_qp_ex::wr_complete"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_complete) - 328usize];
    ["Offset of field: ibv_qp_ex::wr_abort"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_abort) - 336usize];
    ["Offset of field: ibv_qp_ex::wr_atomic_write"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_atomic_write) - 344usize];
    ["Offset of field: ibv_qp_ex::wr_flush"]
        [::std::mem::offset_of!(ibv_qp_ex, wr_flush) - 352usize];
};
impl Default for ibv_qp_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn ibv_qp_to_qp_ex(qp: *mut ibv_qp) -> *mut ibv_qp_ex;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_ece {
    pub vendor_id: u32,
    pub options: u32,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ece"][::std::mem::size_of::<ibv_ece>() - 12usize];
    ["Alignment of ibv_ece"][::std::mem::align_of::<ibv_ece>() - 4usize];
    ["Offset of field: ibv_ece::vendor_id"][::std::mem::offset_of!(ibv_ece, vendor_id) - 0usize];
    ["Offset of field: ibv_ece::options"][::std::mem::offset_of!(ibv_ece, options) - 4usize];
    ["Offset of field: ibv_ece::comp_mask"][::std::mem::offset_of!(ibv_ece, comp_mask) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_comp_channel {
    pub context: *mut ibv_context,
    pub fd: ::std::os::raw::c_int,
    pub refcnt: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_comp_channel"][::std::mem::size_of::<ibv_comp_channel>() - 16usize];
    ["Alignment of ibv_comp_channel"][::std::mem::align_of::<ibv_comp_channel>() - 8usize];
    ["Offset of field: ibv_comp_channel::context"]
        [::std::mem::offset_of!(ibv_comp_channel, context) - 0usize];
    ["Offset of field: ibv_comp_channel::fd"]
        [::std::mem::offset_of!(ibv_comp_channel, fd) - 8usize];
    ["Offset of field: ibv_comp_channel::refcnt"]
        [::std::mem::offset_of!(ibv_comp_channel, refcnt) - 12usize];
};
impl Default for ibv_comp_channel {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_cq {
    pub context: *mut ibv_context,
    pub channel: *mut ibv_comp_channel,
    pub cq_context: *mut ::std::os::raw::c_void,
    pub handle: u32,
    pub cqe: ::std::os::raw::c_int,
    pub mutex: pthread_mutex_t,
    pub cond: pthread_cond_t,
    pub comp_events_completed: u32,
    pub async_events_completed: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_cq"][::std::mem::size_of::<ibv_cq>() - 128usize];
    ["Alignment of ibv_cq"][::std::mem::align_of::<ibv_cq>() - 8usize];
    ["Offset of field: ibv_cq::context"][::std::mem::offset_of!(ibv_cq, context) - 0usize];
    ["Offset of field: ibv_cq::channel"][::std::mem::offset_of!(ibv_cq, channel) - 8usize];
    ["Offset of field: ibv_cq::cq_context"][::std::mem::offset_of!(ibv_cq, cq_context) - 16usize];
    ["Offset of field: ibv_cq::handle"][::std::mem::offset_of!(ibv_cq, handle) - 24usize];
    ["Offset of field: ibv_cq::cqe"][::std::mem::offset_of!(ibv_cq, cqe) - 28usize];
    ["Offset of field: ibv_cq::mutex"][::std::mem::offset_of!(ibv_cq, mutex) - 32usize];
    ["Offset of field: ibv_cq::cond"][::std::mem::offset_of!(ibv_cq, cond) - 72usize];
    ["Offset of field: ibv_cq::comp_events_completed"]
        [::std::mem::offset_of!(ibv_cq, comp_events_completed) - 120usize];
    ["Offset of field: ibv_cq::async_events_completed"]
        [::std::mem::offset_of!(ibv_cq, async_events_completed) - 124usize];
};
impl Default for ibv_cq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_poll_cq_attr {
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_poll_cq_attr"][::std::mem::size_of::<ibv_poll_cq_attr>() - 4usize];
    ["Alignment of ibv_poll_cq_attr"][::std::mem::align_of::<ibv_poll_cq_attr>() - 4usize];
    ["Offset of field: ibv_poll_cq_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_poll_cq_attr, comp_mask) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_wc_tm_info {
    pub tag: u64,
    pub priv_: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_wc_tm_info"][::std::mem::size_of::<ibv_wc_tm_info>() - 16usize];
    ["Alignment of ibv_wc_tm_info"][::std::mem::align_of::<ibv_wc_tm_info>() - 8usize];
    ["Offset of field: ibv_wc_tm_info::tag"][::std::mem::offset_of!(ibv_wc_tm_info, tag) - 0usize];
    ["Offset of field: ibv_wc_tm_info::priv_"]
        [::std::mem::offset_of!(ibv_wc_tm_info, priv_) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_cq_ex {
    pub context: *mut ibv_context,
    pub channel: *mut ibv_comp_channel,
    pub cq_context: *mut ::std::os::raw::c_void,
    pub handle: u32,
    pub cqe: ::std::os::raw::c_int,
    pub mutex: pthread_mutex_t,
    pub cond: pthread_cond_t,
    pub comp_events_completed: u32,
    pub async_events_completed: u32,
    pub comp_mask: u32,
    pub status: ibv_wc_status,
    pub wr_id: u64,
    pub start_poll: ::std::option::Option<
        unsafe extern "C" fn(
            current: *mut ibv_cq_ex,
            attr: *mut ibv_poll_cq_attr,
        ) -> ::std::os::raw::c_int,
    >,
    pub next_poll: ::std::option::Option<
        unsafe extern "C" fn(current: *mut ibv_cq_ex) -> ::std::os::raw::c_int,
    >,
    pub end_poll: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex)>,
    pub read_opcode:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> ibv_wc_opcode>,
    pub read_vendor_err:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_byte_len: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_imm_data:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> __be32>,
    pub read_qp_num: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_src_qp: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_wc_flags: ::std::option::Option<
        unsafe extern "C" fn(current: *mut ibv_cq_ex) -> ::std::os::raw::c_uint,
    >,
    pub read_slid: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_sl: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u8>,
    pub read_dlid_path_bits:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u8>,
    pub read_completion_ts:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u64>,
    pub read_cvlan: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u16>,
    pub read_flow_tag: ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u32>,
    pub read_tm_info: ::std::option::Option<
        unsafe extern "C" fn(current: *mut ibv_cq_ex, tm_info: *mut ibv_wc_tm_info),
    >,
    pub read_completion_wallclock_ns:
        ::std::option::Option<unsafe extern "C" fn(current: *mut ibv_cq_ex) -> u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_cq_ex"][::std::mem::size_of::<ibv_cq_ex>() - 288usize];
    ["Alignment of ibv_cq_ex"][::std::mem::align_of::<ibv_cq_ex>() - 8usize];
    ["Offset of field: ibv_cq_ex::context"][::std::mem::offset_of!(ibv_cq_ex, context) - 0usize];
    ["Offset of field: ibv_cq_ex::channel"][::std::mem::offset_of!(ibv_cq_ex, channel) - 8usize];
    ["Offset of field: ibv_cq_ex::cq_context"]
        [::std::mem::offset_of!(ibv_cq_ex, cq_context) - 16usize];
    ["Offset of field: ibv_cq_ex::handle"][::std::mem::offset_of!(ibv_cq_ex, handle) - 24usize];
    ["Offset of field: ibv_cq_ex::cqe"][::std::mem::offset_of!(ibv_cq_ex, cqe) - 28usize];
    ["Offset of field: ibv_cq_ex::mutex"][::std::mem::offset_of!(ibv_cq_ex, mutex) - 32usize];
    ["Offset of field: ibv_cq_ex::cond"][::std::mem::offset_of!(ibv_cq_ex, cond) - 72usize];
    ["Offset of field: ibv_cq_ex::comp_events_completed"]
        [::std::mem::offset_of!(ibv_cq_ex, comp_events_completed) - 120usize];
    ["Offset of field: ibv_cq_ex::async_events_completed"]
        [::std::mem::offset_of!(ibv_cq_ex, async_events_completed) - 124usize];
    ["Offset of field: ibv_cq_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_cq_ex, comp_mask) - 128usize];
    ["Offset of field: ibv_cq_ex::status"][::std::mem::offset_of!(ibv_cq_ex, status) - 132usize];
    ["Offset of field: ibv_cq_ex::wr_id"][::std::mem::offset_of!(ibv_cq_ex, wr_id) - 136usize];
    ["Offset of field: ibv_cq_ex::start_poll"]
        [::std::mem::offset_of!(ibv_cq_ex, start_poll) - 144usize];
    ["Offset of field: ibv_cq_ex::next_poll"]
        [::std::mem::offset_of!(ibv_cq_ex, next_poll) - 152usize];
    ["Offset of field: ibv_cq_ex::end_poll"]
        [::std::mem::offset_of!(ibv_cq_ex, end_poll) - 160usize];
    ["Offset of field: ibv_cq_ex::read_opcode"]
        [::std::mem::offset_of!(ibv_cq_ex, read_opcode) - 168usize];
    ["Offset of field: ibv_cq_ex::read_vendor_err"]
        [::std::mem::offset_of!(ibv_cq_ex, read_vendor_err) - 176usize];
    ["Offset of field: ibv_cq_ex::read_byte_len"]
        [::std::mem::offset_of!(ibv_cq_ex, read_byte_len) - 184usize];
    ["Offset of field: ibv_cq_ex::read_imm_data"]
        [::std::mem::offset_of!(ibv_cq_ex, read_imm_data) - 192usize];
    ["Offset of field: ibv_cq_ex::read_qp_num"]
        [::std::mem::offset_of!(ibv_cq_ex, read_qp_num) - 200usize];
    ["Offset of field: ibv_cq_ex::read_src_qp"]
        [::std::mem::offset_of!(ibv_cq_ex, read_src_qp) - 208usize];
    ["Offset of field: ibv_cq_ex::read_wc_flags"]
        [::std::mem::offset_of!(ibv_cq_ex, read_wc_flags) - 216usize];
    ["Offset of field: ibv_cq_ex::read_slid"]
        [::std::mem::offset_of!(ibv_cq_ex, read_slid) - 224usize];
    ["Offset of field: ibv_cq_ex::read_sl"][::std::mem::offset_of!(ibv_cq_ex, read_sl) - 232usize];
    ["Offset of field: ibv_cq_ex::read_dlid_path_bits"]
        [::std::mem::offset_of!(ibv_cq_ex, read_dlid_path_bits) - 240usize];
    ["Offset of field: ibv_cq_ex::read_completion_ts"]
        [::std::mem::offset_of!(ibv_cq_ex, read_completion_ts) - 248usize];
    ["Offset of field: ibv_cq_ex::read_cvlan"]
        [::std::mem::offset_of!(ibv_cq_ex, read_cvlan) - 256usize];
    ["Offset of field: ibv_cq_ex::read_flow_tag"]
        [::std::mem::offset_of!(ibv_cq_ex, read_flow_tag) - 264usize];
    ["Offset of field: ibv_cq_ex::read_tm_info"]
        [::std::mem::offset_of!(ibv_cq_ex, read_tm_info) - 272usize];
    ["Offset of field: ibv_cq_ex::read_completion_wallclock_ns"]
        [::std::mem::offset_of!(ibv_cq_ex, read_completion_wallclock_ns) - 280usize];
};
impl Default for ibv_cq_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_cq_attr_mask {
    IBV_CQ_ATTR_MODERATE = 1,
    IBV_CQ_ATTR_RESERVED = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_moderate_cq {
    pub cq_count: u16,
    pub cq_period: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_moderate_cq"][::std::mem::size_of::<ibv_moderate_cq>() - 4usize];
    ["Alignment of ibv_moderate_cq"][::std::mem::align_of::<ibv_moderate_cq>() - 2usize];
    ["Offset of field: ibv_moderate_cq::cq_count"]
        [::std::mem::offset_of!(ibv_moderate_cq, cq_count) - 0usize];
    ["Offset of field: ibv_moderate_cq::cq_period"]
        [::std::mem::offset_of!(ibv_moderate_cq, cq_period) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_modify_cq_attr {
    pub attr_mask: u32,
    pub moderate: ibv_moderate_cq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_modify_cq_attr"][::std::mem::size_of::<ibv_modify_cq_attr>() - 8usize];
    ["Alignment of ibv_modify_cq_attr"][::std::mem::align_of::<ibv_modify_cq_attr>() - 4usize];
    ["Offset of field: ibv_modify_cq_attr::attr_mask"]
        [::std::mem::offset_of!(ibv_modify_cq_attr, attr_mask) - 0usize];
    ["Offset of field: ibv_modify_cq_attr::moderate"]
        [::std::mem::offset_of!(ibv_modify_cq_attr, moderate) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_ah {
    pub context: *mut ibv_context,
    pub pd: *mut ibv_pd,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_ah"][::std::mem::size_of::<ibv_ah>() - 24usize];
    ["Alignment of ibv_ah"][::std::mem::align_of::<ibv_ah>() - 8usize];
    ["Offset of field: ibv_ah::context"][::std::mem::offset_of!(ibv_ah, context) - 0usize];
    ["Offset of field: ibv_ah::pd"][::std::mem::offset_of!(ibv_ah, pd) - 8usize];
    ["Offset of field: ibv_ah::handle"][::std::mem::offset_of!(ibv_ah, handle) - 16usize];
};
impl Default for ibv_ah {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_flow_flags {
    IBV_FLOW_ATTR_FLAGS_DONT_TRAP = 2,
    IBV_FLOW_ATTR_FLAGS_EGRESS = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_flow_attr_type {
    IBV_FLOW_ATTR_NORMAL = 0,
    IBV_FLOW_ATTR_ALL_DEFAULT = 1,
    IBV_FLOW_ATTR_MC_DEFAULT = 2,
    IBV_FLOW_ATTR_SNIFFER = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_flow_spec_type {
    IBV_FLOW_SPEC_ETH = 32,
    IBV_FLOW_SPEC_IPV4 = 48,
    IBV_FLOW_SPEC_IPV6 = 49,
    IBV_FLOW_SPEC_IPV4_EXT = 50,
    IBV_FLOW_SPEC_ESP = 52,
    IBV_FLOW_SPEC_TCP = 64,
    IBV_FLOW_SPEC_UDP = 65,
    IBV_FLOW_SPEC_VXLAN_TUNNEL = 80,
    IBV_FLOW_SPEC_GRE = 81,
    IBV_FLOW_SPEC_MPLS = 96,
    IBV_FLOW_SPEC_INNER = 256,
    IBV_FLOW_SPEC_ACTION_TAG = 4096,
    IBV_FLOW_SPEC_ACTION_DROP = 4097,
    IBV_FLOW_SPEC_ACTION_HANDLE = 4098,
    IBV_FLOW_SPEC_ACTION_COUNT = 4099,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_eth_filter {
    pub dst_mac: [u8; 6usize],
    pub src_mac: [u8; 6usize],
    pub ether_type: u16,
    pub vlan_tag: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_eth_filter"][::std::mem::size_of::<ibv_flow_eth_filter>() - 16usize];
    ["Alignment of ibv_flow_eth_filter"][::std::mem::align_of::<ibv_flow_eth_filter>() - 2usize];
    ["Offset of field: ibv_flow_eth_filter::dst_mac"]
        [::std::mem::offset_of!(ibv_flow_eth_filter, dst_mac) - 0usize];
    ["Offset of field: ibv_flow_eth_filter::src_mac"]
        [::std::mem::offset_of!(ibv_flow_eth_filter, src_mac) - 6usize];
    ["Offset of field: ibv_flow_eth_filter::ether_type"]
        [::std::mem::offset_of!(ibv_flow_eth_filter, ether_type) - 12usize];
    ["Offset of field: ibv_flow_eth_filter::vlan_tag"]
        [::std::mem::offset_of!(ibv_flow_eth_filter, vlan_tag) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_eth {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_eth_filter,
    pub mask: ibv_flow_eth_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_eth"][::std::mem::size_of::<ibv_flow_spec_eth>() - 40usize];
    ["Alignment of ibv_flow_spec_eth"][::std::mem::align_of::<ibv_flow_spec_eth>() - 4usize];
    ["Offset of field: ibv_flow_spec_eth::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_eth, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_eth::size"]
        [::std::mem::offset_of!(ibv_flow_spec_eth, size) - 4usize];
    ["Offset of field: ibv_flow_spec_eth::val"]
        [::std::mem::offset_of!(ibv_flow_spec_eth, val) - 6usize];
    ["Offset of field: ibv_flow_spec_eth::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_eth, mask) - 22usize];
};
impl Default for ibv_flow_spec_eth {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_ipv4_filter {
    pub src_ip: u32,
    pub dst_ip: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_ipv4_filter"][::std::mem::size_of::<ibv_flow_ipv4_filter>() - 8usize];
    ["Alignment of ibv_flow_ipv4_filter"][::std::mem::align_of::<ibv_flow_ipv4_filter>() - 4usize];
    ["Offset of field: ibv_flow_ipv4_filter::src_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv4_filter, src_ip) - 0usize];
    ["Offset of field: ibv_flow_ipv4_filter::dst_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv4_filter, dst_ip) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_ipv4 {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_ipv4_filter,
    pub mask: ibv_flow_ipv4_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_ipv4"][::std::mem::size_of::<ibv_flow_spec_ipv4>() - 24usize];
    ["Alignment of ibv_flow_spec_ipv4"][::std::mem::align_of::<ibv_flow_spec_ipv4>() - 4usize];
    ["Offset of field: ibv_flow_spec_ipv4::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_ipv4::size"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4, size) - 4usize];
    ["Offset of field: ibv_flow_spec_ipv4::val"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4, val) - 8usize];
    ["Offset of field: ibv_flow_spec_ipv4::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4, mask) - 16usize];
};
impl Default for ibv_flow_spec_ipv4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_ipv4_ext_filter {
    pub src_ip: u32,
    pub dst_ip: u32,
    pub proto: u8,
    pub tos: u8,
    pub ttl: u8,
    pub flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_ipv4_ext_filter"]
        [::std::mem::size_of::<ibv_flow_ipv4_ext_filter>() - 12usize];
    ["Alignment of ibv_flow_ipv4_ext_filter"]
        [::std::mem::align_of::<ibv_flow_ipv4_ext_filter>() - 4usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::src_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, src_ip) - 0usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::dst_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, dst_ip) - 4usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::proto"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, proto) - 8usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::tos"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, tos) - 9usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::ttl"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, ttl) - 10usize];
    ["Offset of field: ibv_flow_ipv4_ext_filter::flags"]
        [::std::mem::offset_of!(ibv_flow_ipv4_ext_filter, flags) - 11usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_ipv4_ext {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_ipv4_ext_filter,
    pub mask: ibv_flow_ipv4_ext_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_ipv4_ext"][::std::mem::size_of::<ibv_flow_spec_ipv4_ext>() - 32usize];
    ["Alignment of ibv_flow_spec_ipv4_ext"]
        [::std::mem::align_of::<ibv_flow_spec_ipv4_ext>() - 4usize];
    ["Offset of field: ibv_flow_spec_ipv4_ext::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4_ext, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_ipv4_ext::size"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4_ext, size) - 4usize];
    ["Offset of field: ibv_flow_spec_ipv4_ext::val"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4_ext, val) - 8usize];
    ["Offset of field: ibv_flow_spec_ipv4_ext::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv4_ext, mask) - 20usize];
};
impl Default for ibv_flow_spec_ipv4_ext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_ipv6_filter {
    pub src_ip: [u8; 16usize],
    pub dst_ip: [u8; 16usize],
    pub flow_label: u32,
    pub next_hdr: u8,
    pub traffic_class: u8,
    pub hop_limit: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_ipv6_filter"][::std::mem::size_of::<ibv_flow_ipv6_filter>() - 40usize];
    ["Alignment of ibv_flow_ipv6_filter"][::std::mem::align_of::<ibv_flow_ipv6_filter>() - 4usize];
    ["Offset of field: ibv_flow_ipv6_filter::src_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, src_ip) - 0usize];
    ["Offset of field: ibv_flow_ipv6_filter::dst_ip"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, dst_ip) - 16usize];
    ["Offset of field: ibv_flow_ipv6_filter::flow_label"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, flow_label) - 32usize];
    ["Offset of field: ibv_flow_ipv6_filter::next_hdr"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, next_hdr) - 36usize];
    ["Offset of field: ibv_flow_ipv6_filter::traffic_class"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, traffic_class) - 37usize];
    ["Offset of field: ibv_flow_ipv6_filter::hop_limit"]
        [::std::mem::offset_of!(ibv_flow_ipv6_filter, hop_limit) - 38usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_ipv6 {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_ipv6_filter,
    pub mask: ibv_flow_ipv6_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_ipv6"][::std::mem::size_of::<ibv_flow_spec_ipv6>() - 88usize];
    ["Alignment of ibv_flow_spec_ipv6"][::std::mem::align_of::<ibv_flow_spec_ipv6>() - 4usize];
    ["Offset of field: ibv_flow_spec_ipv6::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv6, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_ipv6::size"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv6, size) - 4usize];
    ["Offset of field: ibv_flow_spec_ipv6::val"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv6, val) - 8usize];
    ["Offset of field: ibv_flow_spec_ipv6::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_ipv6, mask) - 48usize];
};
impl Default for ibv_flow_spec_ipv6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_esp_filter {
    pub spi: u32,
    pub seq: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_esp_filter"][::std::mem::size_of::<ibv_flow_esp_filter>() - 8usize];
    ["Alignment of ibv_flow_esp_filter"][::std::mem::align_of::<ibv_flow_esp_filter>() - 4usize];
    ["Offset of field: ibv_flow_esp_filter::spi"]
        [::std::mem::offset_of!(ibv_flow_esp_filter, spi) - 0usize];
    ["Offset of field: ibv_flow_esp_filter::seq"]
        [::std::mem::offset_of!(ibv_flow_esp_filter, seq) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_esp {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_esp_filter,
    pub mask: ibv_flow_esp_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_esp"][::std::mem::size_of::<ibv_flow_spec_esp>() - 24usize];
    ["Alignment of ibv_flow_spec_esp"][::std::mem::align_of::<ibv_flow_spec_esp>() - 4usize];
    ["Offset of field: ibv_flow_spec_esp::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_esp, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_esp::size"]
        [::std::mem::offset_of!(ibv_flow_spec_esp, size) - 4usize];
    ["Offset of field: ibv_flow_spec_esp::val"]
        [::std::mem::offset_of!(ibv_flow_spec_esp, val) - 8usize];
    ["Offset of field: ibv_flow_spec_esp::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_esp, mask) - 16usize];
};
impl Default for ibv_flow_spec_esp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_tcp_udp_filter {
    pub dst_port: u16,
    pub src_port: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_tcp_udp_filter"][::std::mem::size_of::<ibv_flow_tcp_udp_filter>() - 4usize];
    ["Alignment of ibv_flow_tcp_udp_filter"]
        [::std::mem::align_of::<ibv_flow_tcp_udp_filter>() - 2usize];
    ["Offset of field: ibv_flow_tcp_udp_filter::dst_port"]
        [::std::mem::offset_of!(ibv_flow_tcp_udp_filter, dst_port) - 0usize];
    ["Offset of field: ibv_flow_tcp_udp_filter::src_port"]
        [::std::mem::offset_of!(ibv_flow_tcp_udp_filter, src_port) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_tcp_udp {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_tcp_udp_filter,
    pub mask: ibv_flow_tcp_udp_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_tcp_udp"][::std::mem::size_of::<ibv_flow_spec_tcp_udp>() - 16usize];
    ["Alignment of ibv_flow_spec_tcp_udp"]
        [::std::mem::align_of::<ibv_flow_spec_tcp_udp>() - 4usize];
    ["Offset of field: ibv_flow_spec_tcp_udp::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_tcp_udp, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_tcp_udp::size"]
        [::std::mem::offset_of!(ibv_flow_spec_tcp_udp, size) - 4usize];
    ["Offset of field: ibv_flow_spec_tcp_udp::val"]
        [::std::mem::offset_of!(ibv_flow_spec_tcp_udp, val) - 6usize];
    ["Offset of field: ibv_flow_spec_tcp_udp::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_tcp_udp, mask) - 10usize];
};
impl Default for ibv_flow_spec_tcp_udp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_gre_filter {
    pub c_ks_res0_ver: u16,
    pub protocol: u16,
    pub key: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_gre_filter"][::std::mem::size_of::<ibv_flow_gre_filter>() - 8usize];
    ["Alignment of ibv_flow_gre_filter"][::std::mem::align_of::<ibv_flow_gre_filter>() - 4usize];
    ["Offset of field: ibv_flow_gre_filter::c_ks_res0_ver"]
        [::std::mem::offset_of!(ibv_flow_gre_filter, c_ks_res0_ver) - 0usize];
    ["Offset of field: ibv_flow_gre_filter::protocol"]
        [::std::mem::offset_of!(ibv_flow_gre_filter, protocol) - 2usize];
    ["Offset of field: ibv_flow_gre_filter::key"]
        [::std::mem::offset_of!(ibv_flow_gre_filter, key) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_gre {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_gre_filter,
    pub mask: ibv_flow_gre_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_gre"][::std::mem::size_of::<ibv_flow_spec_gre>() - 24usize];
    ["Alignment of ibv_flow_spec_gre"][::std::mem::align_of::<ibv_flow_spec_gre>() - 4usize];
    ["Offset of field: ibv_flow_spec_gre::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_gre, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_gre::size"]
        [::std::mem::offset_of!(ibv_flow_spec_gre, size) - 4usize];
    ["Offset of field: ibv_flow_spec_gre::val"]
        [::std::mem::offset_of!(ibv_flow_spec_gre, val) - 8usize];
    ["Offset of field: ibv_flow_spec_gre::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_gre, mask) - 16usize];
};
impl Default for ibv_flow_spec_gre {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_mpls_filter {
    pub label: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_mpls_filter"][::std::mem::size_of::<ibv_flow_mpls_filter>() - 4usize];
    ["Alignment of ibv_flow_mpls_filter"][::std::mem::align_of::<ibv_flow_mpls_filter>() - 4usize];
    ["Offset of field: ibv_flow_mpls_filter::label"]
        [::std::mem::offset_of!(ibv_flow_mpls_filter, label) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_mpls {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_mpls_filter,
    pub mask: ibv_flow_mpls_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_mpls"][::std::mem::size_of::<ibv_flow_spec_mpls>() - 16usize];
    ["Alignment of ibv_flow_spec_mpls"][::std::mem::align_of::<ibv_flow_spec_mpls>() - 4usize];
    ["Offset of field: ibv_flow_spec_mpls::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_mpls, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_mpls::size"]
        [::std::mem::offset_of!(ibv_flow_spec_mpls, size) - 4usize];
    ["Offset of field: ibv_flow_spec_mpls::val"]
        [::std::mem::offset_of!(ibv_flow_spec_mpls, val) - 8usize];
    ["Offset of field: ibv_flow_spec_mpls::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_mpls, mask) - 12usize];
};
impl Default for ibv_flow_spec_mpls {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_flow_tunnel_filter {
    pub tunnel_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_tunnel_filter"][::std::mem::size_of::<ibv_flow_tunnel_filter>() - 4usize];
    ["Alignment of ibv_flow_tunnel_filter"]
        [::std::mem::align_of::<ibv_flow_tunnel_filter>() - 4usize];
    ["Offset of field: ibv_flow_tunnel_filter::tunnel_id"]
        [::std::mem::offset_of!(ibv_flow_tunnel_filter, tunnel_id) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_tunnel {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub val: ibv_flow_tunnel_filter,
    pub mask: ibv_flow_tunnel_filter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_tunnel"][::std::mem::size_of::<ibv_flow_spec_tunnel>() - 16usize];
    ["Alignment of ibv_flow_spec_tunnel"][::std::mem::align_of::<ibv_flow_spec_tunnel>() - 4usize];
    ["Offset of field: ibv_flow_spec_tunnel::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_tunnel, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_tunnel::size"]
        [::std::mem::offset_of!(ibv_flow_spec_tunnel, size) - 4usize];
    ["Offset of field: ibv_flow_spec_tunnel::val"]
        [::std::mem::offset_of!(ibv_flow_spec_tunnel, val) - 8usize];
    ["Offset of field: ibv_flow_spec_tunnel::mask"]
        [::std::mem::offset_of!(ibv_flow_spec_tunnel, mask) - 12usize];
};
impl Default for ibv_flow_spec_tunnel {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_action_tag {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub tag_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_action_tag"]
        [::std::mem::size_of::<ibv_flow_spec_action_tag>() - 12usize];
    ["Alignment of ibv_flow_spec_action_tag"]
        [::std::mem::align_of::<ibv_flow_spec_action_tag>() - 4usize];
    ["Offset of field: ibv_flow_spec_action_tag::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_action_tag, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_action_tag::size"]
        [::std::mem::offset_of!(ibv_flow_spec_action_tag, size) - 4usize];
    ["Offset of field: ibv_flow_spec_action_tag::tag_id"]
        [::std::mem::offset_of!(ibv_flow_spec_action_tag, tag_id) - 8usize];
};
impl Default for ibv_flow_spec_action_tag {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_action_drop {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_action_drop"]
        [::std::mem::size_of::<ibv_flow_spec_action_drop>() - 8usize];
    ["Alignment of ibv_flow_spec_action_drop"]
        [::std::mem::align_of::<ibv_flow_spec_action_drop>() - 4usize];
    ["Offset of field: ibv_flow_spec_action_drop::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_action_drop, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_action_drop::size"]
        [::std::mem::offset_of!(ibv_flow_spec_action_drop, size) - 4usize];
};
impl Default for ibv_flow_spec_action_drop {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_action_handle {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub action: *const ibv_flow_action,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_action_handle"]
        [::std::mem::size_of::<ibv_flow_spec_action_handle>() - 16usize];
    ["Alignment of ibv_flow_spec_action_handle"]
        [::std::mem::align_of::<ibv_flow_spec_action_handle>() - 8usize];
    ["Offset of field: ibv_flow_spec_action_handle::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_action_handle, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_action_handle::size"]
        [::std::mem::offset_of!(ibv_flow_spec_action_handle, size) - 4usize];
    ["Offset of field: ibv_flow_spec_action_handle::action"]
        [::std::mem::offset_of!(ibv_flow_spec_action_handle, action) - 8usize];
};
impl Default for ibv_flow_spec_action_handle {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec_counter_action {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
    pub counters: *mut ibv_counters,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec_counter_action"]
        [::std::mem::size_of::<ibv_flow_spec_counter_action>() - 16usize];
    ["Alignment of ibv_flow_spec_counter_action"]
        [::std::mem::align_of::<ibv_flow_spec_counter_action>() - 8usize];
    ["Offset of field: ibv_flow_spec_counter_action::type_"]
        [::std::mem::offset_of!(ibv_flow_spec_counter_action, type_) - 0usize];
    ["Offset of field: ibv_flow_spec_counter_action::size"]
        [::std::mem::offset_of!(ibv_flow_spec_counter_action, size) - 4usize];
    ["Offset of field: ibv_flow_spec_counter_action::counters"]
        [::std::mem::offset_of!(ibv_flow_spec_counter_action, counters) - 8usize];
};
impl Default for ibv_flow_spec_counter_action {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_flow_spec {
    pub __bindgen_anon_1: ibv_flow_spec__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_flow_spec__bindgen_ty_1 {
    pub hdr: ibv_flow_spec__bindgen_ty_1__bindgen_ty_1,
    pub eth: ibv_flow_spec_eth,
    pub ipv4: ibv_flow_spec_ipv4,
    pub tcp_udp: ibv_flow_spec_tcp_udp,
    pub ipv4_ext: ibv_flow_spec_ipv4_ext,
    pub ipv6: ibv_flow_spec_ipv6,
    pub esp: ibv_flow_spec_esp,
    pub tunnel: ibv_flow_spec_tunnel,
    pub gre: ibv_flow_spec_gre,
    pub mpls: ibv_flow_spec_mpls,
    pub flow_tag: ibv_flow_spec_action_tag,
    pub drop: ibv_flow_spec_action_drop,
    pub handle: ibv_flow_spec_action_handle,
    pub flow_count: ibv_flow_spec_counter_action,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_spec__bindgen_ty_1__bindgen_ty_1 {
    pub type_: ibv_flow_spec_type,
    pub size: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_flow_spec__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ibv_flow_spec__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_flow_spec__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1__bindgen_ty_1::size"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1__bindgen_ty_1, size) - 4usize];
};
impl Default for ibv_flow_spec__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec__bindgen_ty_1"]
        [::std::mem::size_of::<ibv_flow_spec__bindgen_ty_1>() - 88usize];
    ["Alignment of ibv_flow_spec__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_flow_spec__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, hdr) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::eth"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, eth) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::ipv4"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, ipv4) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::tcp_udp"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, tcp_udp) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::ipv4_ext"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, ipv4_ext) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::ipv6"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, ipv6) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::esp"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, esp) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::tunnel"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, tunnel) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::gre"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, gre) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::mpls"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, mpls) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::flow_tag"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, flow_tag) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::drop"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, drop) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::handle"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, handle) - 0usize];
    ["Offset of field: ibv_flow_spec__bindgen_ty_1::flow_count"]
        [::std::mem::offset_of!(ibv_flow_spec__bindgen_ty_1, flow_count) - 0usize];
};
impl Default for ibv_flow_spec__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_spec"][::std::mem::size_of::<ibv_flow_spec>() - 88usize];
    ["Alignment of ibv_flow_spec"][::std::mem::align_of::<ibv_flow_spec>() - 8usize];
};
impl Default for ibv_flow_spec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_attr {
    pub comp_mask: u32,
    pub type_: ibv_flow_attr_type,
    pub size: u16,
    pub priority: u16,
    pub num_of_specs: u8,
    pub port: u8,
    pub flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_attr"][::std::mem::size_of::<ibv_flow_attr>() - 20usize];
    ["Alignment of ibv_flow_attr"][::std::mem::align_of::<ibv_flow_attr>() - 4usize];
    ["Offset of field: ibv_flow_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_flow_attr, comp_mask) - 0usize];
    ["Offset of field: ibv_flow_attr::type_"]
        [::std::mem::offset_of!(ibv_flow_attr, type_) - 4usize];
    ["Offset of field: ibv_flow_attr::size"][::std::mem::offset_of!(ibv_flow_attr, size) - 8usize];
    ["Offset of field: ibv_flow_attr::priority"]
        [::std::mem::offset_of!(ibv_flow_attr, priority) - 10usize];
    ["Offset of field: ibv_flow_attr::num_of_specs"]
        [::std::mem::offset_of!(ibv_flow_attr, num_of_specs) - 12usize];
    ["Offset of field: ibv_flow_attr::port"][::std::mem::offset_of!(ibv_flow_attr, port) - 13usize];
    ["Offset of field: ibv_flow_attr::flags"]
        [::std::mem::offset_of!(ibv_flow_attr, flags) - 16usize];
};
impl Default for ibv_flow_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow {
    pub comp_mask: u32,
    pub context: *mut ibv_context,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow"][::std::mem::size_of::<ibv_flow>() - 24usize];
    ["Alignment of ibv_flow"][::std::mem::align_of::<ibv_flow>() - 8usize];
    ["Offset of field: ibv_flow::comp_mask"][::std::mem::offset_of!(ibv_flow, comp_mask) - 0usize];
    ["Offset of field: ibv_flow::context"][::std::mem::offset_of!(ibv_flow, context) - 8usize];
    ["Offset of field: ibv_flow::handle"][::std::mem::offset_of!(ibv_flow, handle) - 16usize];
};
impl Default for ibv_flow {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_action {
    pub context: *mut ibv_context,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_action"][::std::mem::size_of::<ibv_flow_action>() - 8usize];
    ["Alignment of ibv_flow_action"][::std::mem::align_of::<ibv_flow_action>() - 8usize];
    ["Offset of field: ibv_flow_action::context"]
        [::std::mem::offset_of!(ibv_flow_action, context) - 0usize];
};
impl Default for ibv_flow_action {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_flow_action_esp_mask {
    IBV_FLOW_ACTION_ESP_MASK_ESN = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_flow_action_esp_attr {
    pub esp_attr: *mut ib_uverbs_flow_action_esp,
    pub keymat_proto: ib_uverbs_flow_action_esp_keymat,
    pub keymat_len: u16,
    pub keymat_ptr: *mut ::std::os::raw::c_void,
    pub replay_proto: ib_uverbs_flow_action_esp_replay,
    pub replay_len: u16,
    pub replay_ptr: *mut ::std::os::raw::c_void,
    pub esp_encap: *mut ib_uverbs_flow_action_esp_encap,
    pub comp_mask: u32,
    pub esn: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_flow_action_esp_attr"]
        [::std::mem::size_of::<ibv_flow_action_esp_attr>() - 56usize];
    ["Alignment of ibv_flow_action_esp_attr"]
        [::std::mem::align_of::<ibv_flow_action_esp_attr>() - 8usize];
    ["Offset of field: ibv_flow_action_esp_attr::esp_attr"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, esp_attr) - 0usize];
    ["Offset of field: ibv_flow_action_esp_attr::keymat_proto"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, keymat_proto) - 8usize];
    ["Offset of field: ibv_flow_action_esp_attr::keymat_len"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, keymat_len) - 12usize];
    ["Offset of field: ibv_flow_action_esp_attr::keymat_ptr"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, keymat_ptr) - 16usize];
    ["Offset of field: ibv_flow_action_esp_attr::replay_proto"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, replay_proto) - 24usize];
    ["Offset of field: ibv_flow_action_esp_attr::replay_len"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, replay_len) - 28usize];
    ["Offset of field: ibv_flow_action_esp_attr::replay_ptr"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, replay_ptr) - 32usize];
    ["Offset of field: ibv_flow_action_esp_attr::esp_encap"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, esp_encap) - 40usize];
    ["Offset of field: ibv_flow_action_esp_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, comp_mask) - 48usize];
    ["Offset of field: ibv_flow_action_esp_attr::esn"]
        [::std::mem::offset_of!(ibv_flow_action_esp_attr, esn) - 52usize];
};
impl Default for ibv_flow_action_esp_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _ibv_device_ops {
    pub _dummy1: ::std::option::Option<
        unsafe extern "C" fn(
            device: *mut ibv_device,
            cmd_fd: ::std::os::raw::c_int,
        ) -> *mut ibv_context,
    >,
    pub _dummy2: ::std::option::Option<unsafe extern "C" fn(context: *mut ibv_context)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ibv_device_ops"][::std::mem::size_of::<_ibv_device_ops>() - 16usize];
    ["Alignment of _ibv_device_ops"][::std::mem::align_of::<_ibv_device_ops>() - 8usize];
    ["Offset of field: _ibv_device_ops::_dummy1"]
        [::std::mem::offset_of!(_ibv_device_ops, _dummy1) - 0usize];
    ["Offset of field: _ibv_device_ops::_dummy2"]
        [::std::mem::offset_of!(_ibv_device_ops, _dummy2) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_device {
    pub _ops: _ibv_device_ops,
    pub node_type: ibv_node_type,
    pub transport_type: ibv_transport_type,
    pub name: [::std::os::raw::c_char; 64usize],
    pub dev_name: [::std::os::raw::c_char; 64usize],
    pub dev_path: [::std::os::raw::c_char; 256usize],
    pub ibdev_path: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_device"][::std::mem::size_of::<ibv_device>() - 664usize];
    ["Alignment of ibv_device"][::std::mem::align_of::<ibv_device>() - 8usize];
    ["Offset of field: ibv_device::_ops"][::std::mem::offset_of!(ibv_device, _ops) - 0usize];
    ["Offset of field: ibv_device::node_type"]
        [::std::mem::offset_of!(ibv_device, node_type) - 16usize];
    ["Offset of field: ibv_device::transport_type"]
        [::std::mem::offset_of!(ibv_device, transport_type) - 20usize];
    ["Offset of field: ibv_device::name"][::std::mem::offset_of!(ibv_device, name) - 24usize];
    ["Offset of field: ibv_device::dev_name"]
        [::std::mem::offset_of!(ibv_device, dev_name) - 88usize];
    ["Offset of field: ibv_device::dev_path"]
        [::std::mem::offset_of!(ibv_device, dev_path) - 152usize];
    ["Offset of field: ibv_device::ibdev_path"]
        [::std::mem::offset_of!(ibv_device, ibdev_path) - 408usize];
};
impl Default for ibv_device {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _compat_ibv_port_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_context_ops {
    pub _compat_query_device: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut ibv_context,
            device_attr: *mut ibv_device_attr,
        ) -> ::std::os::raw::c_int,
    >,
    pub _compat_query_port: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut ibv_context,
            port_num: u8,
            port_attr: *mut _compat_ibv_port_attr,
        ) -> ::std::os::raw::c_int,
    >,
    pub _compat_alloc_pd:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_dealloc_pd:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_reg_mr:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_rereg_mr:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_dereg_mr:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub alloc_mw: ::std::option::Option<
        unsafe extern "C" fn(pd: *mut ibv_pd, type_: ibv_mw_type) -> *mut ibv_mw,
    >,
    pub bind_mw: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp,
            mw: *mut ibv_mw,
            mw_bind: *mut ibv_mw_bind,
        ) -> ::std::os::raw::c_int,
    >,
    pub dealloc_mw:
        ::std::option::Option<unsafe extern "C" fn(mw: *mut ibv_mw) -> ::std::os::raw::c_int>,
    pub _compat_create_cq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub poll_cq: ::std::option::Option<
        unsafe extern "C" fn(
            cq: *mut ibv_cq,
            num_entries: ::std::os::raw::c_int,
            wc: *mut ibv_wc,
        ) -> ::std::os::raw::c_int,
    >,
    pub req_notify_cq: ::std::option::Option<
        unsafe extern "C" fn(
            cq: *mut ibv_cq,
            solicited_only: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _compat_cq_event:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_resize_cq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_destroy_cq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_create_srq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_modify_srq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_query_srq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_destroy_srq:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub post_srq_recv: ::std::option::Option<
        unsafe extern "C" fn(
            srq: *mut ibv_srq,
            recv_wr: *mut ibv_recv_wr,
            bad_recv_wr: *mut *mut ibv_recv_wr,
        ) -> ::std::os::raw::c_int,
    >,
    pub _compat_create_qp:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_query_qp:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_modify_qp:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_destroy_qp:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub post_send: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp,
            wr: *mut ibv_send_wr,
            bad_wr: *mut *mut ibv_send_wr,
        ) -> ::std::os::raw::c_int,
    >,
    pub post_recv: ::std::option::Option<
        unsafe extern "C" fn(
            qp: *mut ibv_qp,
            wr: *mut ibv_recv_wr,
            bad_wr: *mut *mut ibv_recv_wr,
        ) -> ::std::os::raw::c_int,
    >,
    pub _compat_create_ah:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_destroy_ah:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_attach_mcast:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_detach_mcast:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub _compat_async_event:
        ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_context_ops"][::std::mem::size_of::<ibv_context_ops>() - 256usize];
    ["Alignment of ibv_context_ops"][::std::mem::align_of::<ibv_context_ops>() - 8usize];
    ["Offset of field: ibv_context_ops::_compat_query_device"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_query_device) - 0usize];
    ["Offset of field: ibv_context_ops::_compat_query_port"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_query_port) - 8usize];
    ["Offset of field: ibv_context_ops::_compat_alloc_pd"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_alloc_pd) - 16usize];
    ["Offset of field: ibv_context_ops::_compat_dealloc_pd"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_dealloc_pd) - 24usize];
    ["Offset of field: ibv_context_ops::_compat_reg_mr"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_reg_mr) - 32usize];
    ["Offset of field: ibv_context_ops::_compat_rereg_mr"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_rereg_mr) - 40usize];
    ["Offset of field: ibv_context_ops::_compat_dereg_mr"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_dereg_mr) - 48usize];
    ["Offset of field: ibv_context_ops::alloc_mw"]
        [::std::mem::offset_of!(ibv_context_ops, alloc_mw) - 56usize];
    ["Offset of field: ibv_context_ops::bind_mw"]
        [::std::mem::offset_of!(ibv_context_ops, bind_mw) - 64usize];
    ["Offset of field: ibv_context_ops::dealloc_mw"]
        [::std::mem::offset_of!(ibv_context_ops, dealloc_mw) - 72usize];
    ["Offset of field: ibv_context_ops::_compat_create_cq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_create_cq) - 80usize];
    ["Offset of field: ibv_context_ops::poll_cq"]
        [::std::mem::offset_of!(ibv_context_ops, poll_cq) - 88usize];
    ["Offset of field: ibv_context_ops::req_notify_cq"]
        [::std::mem::offset_of!(ibv_context_ops, req_notify_cq) - 96usize];
    ["Offset of field: ibv_context_ops::_compat_cq_event"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_cq_event) - 104usize];
    ["Offset of field: ibv_context_ops::_compat_resize_cq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_resize_cq) - 112usize];
    ["Offset of field: ibv_context_ops::_compat_destroy_cq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_destroy_cq) - 120usize];
    ["Offset of field: ibv_context_ops::_compat_create_srq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_create_srq) - 128usize];
    ["Offset of field: ibv_context_ops::_compat_modify_srq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_modify_srq) - 136usize];
    ["Offset of field: ibv_context_ops::_compat_query_srq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_query_srq) - 144usize];
    ["Offset of field: ibv_context_ops::_compat_destroy_srq"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_destroy_srq) - 152usize];
    ["Offset of field: ibv_context_ops::post_srq_recv"]
        [::std::mem::offset_of!(ibv_context_ops, post_srq_recv) - 160usize];
    ["Offset of field: ibv_context_ops::_compat_create_qp"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_create_qp) - 168usize];
    ["Offset of field: ibv_context_ops::_compat_query_qp"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_query_qp) - 176usize];
    ["Offset of field: ibv_context_ops::_compat_modify_qp"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_modify_qp) - 184usize];
    ["Offset of field: ibv_context_ops::_compat_destroy_qp"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_destroy_qp) - 192usize];
    ["Offset of field: ibv_context_ops::post_send"]
        [::std::mem::offset_of!(ibv_context_ops, post_send) - 200usize];
    ["Offset of field: ibv_context_ops::post_recv"]
        [::std::mem::offset_of!(ibv_context_ops, post_recv) - 208usize];
    ["Offset of field: ibv_context_ops::_compat_create_ah"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_create_ah) - 216usize];
    ["Offset of field: ibv_context_ops::_compat_destroy_ah"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_destroy_ah) - 224usize];
    ["Offset of field: ibv_context_ops::_compat_attach_mcast"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_attach_mcast) - 232usize];
    ["Offset of field: ibv_context_ops::_compat_detach_mcast"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_detach_mcast) - 240usize];
    ["Offset of field: ibv_context_ops::_compat_async_event"]
        [::std::mem::offset_of!(ibv_context_ops, _compat_async_event) - 248usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_context {
    pub device: *mut ibv_device,
    pub ops: ibv_context_ops,
    pub cmd_fd: ::std::os::raw::c_int,
    pub async_fd: ::std::os::raw::c_int,
    pub num_comp_vectors: ::std::os::raw::c_int,
    pub mutex: pthread_mutex_t,
    pub abi_compat: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_context"][::std::mem::size_of::<ibv_context>() - 328usize];
    ["Alignment of ibv_context"][::std::mem::align_of::<ibv_context>() - 8usize];
    ["Offset of field: ibv_context::device"][::std::mem::offset_of!(ibv_context, device) - 0usize];
    ["Offset of field: ibv_context::ops"][::std::mem::offset_of!(ibv_context, ops) - 8usize];
    ["Offset of field: ibv_context::cmd_fd"]
        [::std::mem::offset_of!(ibv_context, cmd_fd) - 264usize];
    ["Offset of field: ibv_context::async_fd"]
        [::std::mem::offset_of!(ibv_context, async_fd) - 268usize];
    ["Offset of field: ibv_context::num_comp_vectors"]
        [::std::mem::offset_of!(ibv_context, num_comp_vectors) - 272usize];
    ["Offset of field: ibv_context::mutex"][::std::mem::offset_of!(ibv_context, mutex) - 280usize];
    ["Offset of field: ibv_context::abi_compat"]
        [::std::mem::offset_of!(ibv_context, abi_compat) - 320usize];
};
impl Default for ibv_context {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_cq_init_attr_mask {
    IBV_CQ_INIT_ATTR_MASK_FLAGS = 1,
    IBV_CQ_INIT_ATTR_MASK_PD = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_create_cq_attr_flags {
    IBV_CREATE_CQ_ATTR_SINGLE_THREADED = 1,
    IBV_CREATE_CQ_ATTR_IGNORE_OVERRUN = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_cq_init_attr_ex {
    pub cqe: u32,
    pub cq_context: *mut ::std::os::raw::c_void,
    pub channel: *mut ibv_comp_channel,
    pub comp_vector: u32,
    pub wc_flags: u64,
    pub comp_mask: u32,
    pub flags: u32,
    pub parent_domain: *mut ibv_pd,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_cq_init_attr_ex"][::std::mem::size_of::<ibv_cq_init_attr_ex>() - 56usize];
    ["Alignment of ibv_cq_init_attr_ex"][::std::mem::align_of::<ibv_cq_init_attr_ex>() - 8usize];
    ["Offset of field: ibv_cq_init_attr_ex::cqe"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, cqe) - 0usize];
    ["Offset of field: ibv_cq_init_attr_ex::cq_context"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, cq_context) - 8usize];
    ["Offset of field: ibv_cq_init_attr_ex::channel"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, channel) - 16usize];
    ["Offset of field: ibv_cq_init_attr_ex::comp_vector"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, comp_vector) - 24usize];
    ["Offset of field: ibv_cq_init_attr_ex::wc_flags"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, wc_flags) - 32usize];
    ["Offset of field: ibv_cq_init_attr_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, comp_mask) - 40usize];
    ["Offset of field: ibv_cq_init_attr_ex::flags"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, flags) - 44usize];
    ["Offset of field: ibv_cq_init_attr_ex::parent_domain"]
        [::std::mem::offset_of!(ibv_cq_init_attr_ex, parent_domain) - 48usize];
};
impl Default for ibv_cq_init_attr_ex {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_parent_domain_init_attr_mask {
    IBV_PARENT_DOMAIN_INIT_ATTR_ALLOCATORS = 1,
    IBV_PARENT_DOMAIN_INIT_ATTR_PD_CONTEXT = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_parent_domain_init_attr {
    pub pd: *mut ibv_pd,
    pub td: *mut ibv_td,
    pub comp_mask: u32,
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(
            pd: *mut ibv_pd,
            pd_context: *mut ::std::os::raw::c_void,
            size: usize,
            alignment: usize,
            resource_type: u64,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub free: ::std::option::Option<
        unsafe extern "C" fn(
            pd: *mut ibv_pd,
            pd_context: *mut ::std::os::raw::c_void,
            ptr: *mut ::std::os::raw::c_void,
            resource_type: u64,
        ),
    >,
    pub pd_context: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_parent_domain_init_attr"]
        [::std::mem::size_of::<ibv_parent_domain_init_attr>() - 48usize];
    ["Alignment of ibv_parent_domain_init_attr"]
        [::std::mem::align_of::<ibv_parent_domain_init_attr>() - 8usize];
    ["Offset of field: ibv_parent_domain_init_attr::pd"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, pd) - 0usize];
    ["Offset of field: ibv_parent_domain_init_attr::td"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, td) - 8usize];
    ["Offset of field: ibv_parent_domain_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, comp_mask) - 16usize];
    ["Offset of field: ibv_parent_domain_init_attr::alloc"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, alloc) - 24usize];
    ["Offset of field: ibv_parent_domain_init_attr::free"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, free) - 32usize];
    ["Offset of field: ibv_parent_domain_init_attr::pd_context"]
        [::std::mem::offset_of!(ibv_parent_domain_init_attr, pd_context) - 40usize];
};
impl Default for ibv_parent_domain_init_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_counters_init_attr {
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_counters_init_attr"][::std::mem::size_of::<ibv_counters_init_attr>() - 4usize];
    ["Alignment of ibv_counters_init_attr"]
        [::std::mem::align_of::<ibv_counters_init_attr>() - 4usize];
    ["Offset of field: ibv_counters_init_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_counters_init_attr, comp_mask) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_counters {
    pub context: *mut ibv_context,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_counters"][::std::mem::size_of::<ibv_counters>() - 8usize];
    ["Alignment of ibv_counters"][::std::mem::align_of::<ibv_counters>() - 8usize];
    ["Offset of field: ibv_counters::context"]
        [::std::mem::offset_of!(ibv_counters, context) - 0usize];
};
impl Default for ibv_counters {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_counter_description {
    IBV_COUNTER_PACKETS = 0,
    IBV_COUNTER_BYTES = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_counter_attach_attr {
    pub counter_desc: ibv_counter_description,
    pub index: u32,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_counter_attach_attr"][::std::mem::size_of::<ibv_counter_attach_attr>() - 12usize];
    ["Alignment of ibv_counter_attach_attr"]
        [::std::mem::align_of::<ibv_counter_attach_attr>() - 4usize];
    ["Offset of field: ibv_counter_attach_attr::counter_desc"]
        [::std::mem::offset_of!(ibv_counter_attach_attr, counter_desc) - 0usize];
    ["Offset of field: ibv_counter_attach_attr::index"]
        [::std::mem::offset_of!(ibv_counter_attach_attr, index) - 4usize];
    ["Offset of field: ibv_counter_attach_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_counter_attach_attr, comp_mask) - 8usize];
};
impl Default for ibv_counter_attach_attr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_read_counters_flags {
    IBV_READ_COUNTERS_ATTR_PREFER_CACHED = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ibv_values_mask {
    IBV_VALUES_MASK_RAW_CLOCK = 1,
    IBV_VALUES_MASK_RESERVED = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_values_ex {
    pub comp_mask: u32,
    pub raw_clock: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_values_ex"][::std::mem::size_of::<ibv_values_ex>() - 24usize];
    ["Alignment of ibv_values_ex"][::std::mem::align_of::<ibv_values_ex>() - 8usize];
    ["Offset of field: ibv_values_ex::comp_mask"]
        [::std::mem::offset_of!(ibv_values_ex, comp_mask) - 0usize];
    ["Offset of field: ibv_values_ex::raw_clock"]
        [::std::mem::offset_of!(ibv_values_ex, raw_clock) - 8usize];
};
unsafe extern "C" {
    #[doc = " ibv_get_device_list - Get list of IB devices currently available\n @num_devices: optional.  if non-NULL, set to the number of devices\n returned in the array.\n\n Return a NULL-terminated array of IB devices.  The array can be\n released with ibv_free_device_list()."]
    pub fn ibv_get_device_list(num_devices: *mut ::std::os::raw::c_int) -> *mut *mut ibv_device;
}
unsafe extern "C" {
    #[doc = " ibv_free_device_list - Free list from ibv_get_device_list()\n\n Free an array of devices returned from ibv_get_device_list().  Once\n the array is freed, pointers to devices that were not opened with\n ibv_open_device() are no longer valid.  Client code must open all\n devices it intends to use before calling ibv_free_device_list()."]
    pub fn ibv_free_device_list(list: *mut *mut ibv_device);
}
unsafe extern "C" {
